//ÇÑ±Û Å¬·¡½º ¸Ş¼Òµå
#include <windows.h>

#include "Han.h"

#define HAN_MAX 2364
#define	MOUM	19

char* han1[]={"°¡","rk","°¢","rkr","A","rkR","°£","rks","°¤","rke","°¥","rkf","°¦","rkfr","°§","rkfa","E","rkfq","F","rkft",
			"G","rkfx","H","rkfv","I","rkfg","°¨","rka","°©","rkq","°ª","rkqt","°«","rkt","°¬","rkT","°­","rkd","°®","rkw",
			"°¯","rkc","°°","rkx","°±","rkv","°²","rkg","°³","ro","°´","ror","°µ","ros","°¶","roe","°·","roa","°¸","roq",
			"°¹","rot","°º","roT","°»","rod","°¼","ri","°½","rir","°¾","ris","°¿","rif","°À","rit","°Á","rid","°Â","rO",
			"°Ã","rOs","°Ä","rOf","°Å","rj","°Æ","rjr","°Ç","rjs","°È","rje","°É","rjf","°Ê","rjfa","°Ë","rja","°Ì","rjq",
			"°Í","rjt","°Î","rjT","°Ï","rjd","°Ğ","rjw","°Ñ","rjx","°Ò","rjv","°Ó","rjg","°Ô","rp","°Õ","rps","°Ö","rpf",
			"°×","rpa","°Ø","rpq","°Ù","rpt","°Ú","rpT","°Û","rpd","°Ü","ru","°İ","rur","°Ş","rur","°ß","rus","°à","rue",
			"°á","ruf","°â","rua","°ã","ruq","°ä","rut","°å","ruT","°æ","rud","°ç","rux","°è","rP","°é","rPs","°ê","rPf",
			"°ë","rPq","°ì","rPt","°í","rh","°î","rhr","°ï","rhs","°ğ","rhe","°ñ","rhf","°ò","rhfa","°ó","rhft","°ô","rhfg",
			"°õ","rha","°ö","rhq","°÷","rht","°ø","rhd","°ù","rhw","°ú","rhk","°û","rhkr","°ü","rhks","°ı","rhkf","°ş","rhkfa",
			"±¡","rhka","±¢","rhkq","±£","rhkt","±¤","rhkd","±¥","rho","±¦","rhos","±§","rhof","±¨","rhoq","±©","rhoT","±ª","rhod",
			"±«","rhl","±¬","rhlr","±­","rhls","±®","rhlf","±¯","rhla","±°","rhlq","±±","rhlt","±²","rhld","±³","ry","±´","rys",
			"±µ","ryf","±¶","ryq","±·","ryt","±¸","rn","±¹","rnr","±º","rns","±»","rne","±¼","rnf","±½","rnfr","±¾","rnfa",
			"±¿","rnfg","±À","rna","±Á","rnq","±Â","rnt","±Ã","rnd","±Ä","rnw","±Å","rnj","±Æ","rnjr","±Ç","rnjs","±È","rnjf",
			"±É","rnjT","±Ê","rnjd","±Ë","rnp","±Ì","rnpt","±Í","rnl","±Î","rnlr","±Ï","rnls","±Ğ","rnlf","±Ñ","rnla","±Ò","rnlq",
			"±Ó","rnlt","±Ô","rb","±Õ","rbs","±Ö","rbf","±×","rm","±Ø","rmr","±Ù","rms","±Ú","rme","±Û","rmf","±Ü","rmfr",
			"±İ","rma","±Ş","rmq","±ß","rmt","±à","rmd","±á","rml","±â","rl","±ã","rlr","±ä","rls","±å","rle","±æ","rlf",
			"±ç","rlfa","±è","rla","±é","rlq","±ê","rlt","±ë","rld","±ì","rlw","±í","rlv","±î","Rk","±ï","Rkr","±ğ","RkR",
			"±ñ","Rks","±ò","Rkf","±ó","Rkfa","±ô","Rka","±õ","Rkq","±ö","Rkt","±÷","RkT","±ø","Rkd","±ù","Rkx","±ú","Ro",
			"±û","Ror","±ü","Ros","±ı","Rof","±ş","Roa","²¡","Roq","²¢","Rot","²£","RoT","²¤","Rod","²¥","Ri","²¦","Rir",
			"²§","Rif","²¨","Rj","²©","Rjr","²ª","RjR","²«","Rjs","²¬","Rjf","²­","Rja","²®","Rjq","²¯","Rjt","²°","RjT",
			"²±","Rjd","²²","Rp","²³","Rpr","ƒô","RpR","²´","Rps","²µ","Rpa","²¶","Rpt","²·","Rpd","²¸","Ru","²¹","Rus",
			"²º","Ruf","²»","Rut","²¼","RuT","²½","Rux","²¾","RP","²¿","Rh","²À","Rhr","²Á","Rhs","²Ä","Rha","²Â","Rhsg",
			"²Ã","Rhf","²Ä","Rha","²Å","Rhq","²Æ","Rht","²Ç","Rhd","²È","Rhw","²É","Rhc","²Ê","Rhk","²Ë","Rhkr","²Ì","Rhkf",
			"²Í","RhkT","²Î","Rhkd","²Ï","Rho","²Ğ","Rhor","²Ñ","Rhod","²Ò","Rhl","²Ó","Rhls","²Ô","RHlf","²Õ","Rhla","²Ö","Rhlq",
			"²×","Rhld","²Ø","Ry","²Ù","Rn","²Ú","Rnr","²Û","Rns","²Ü","Rnf","²İ","Rnfg","²Ş","Rna","²ß","Rnq","²à","Rnt",
			"²á","Rnd","²â","Rnw","²ã","Rnj","²ä","Rnjf","²å","RnjT","²æ","Rnjd","²ç","Rnp","²è","Rnpr","²é","Rnps","²ê","Rnpf",
			"²ë","Rnpa","²ì","Rnpq","²í","RnpT","²î","Rnl","²ï","Rnls","²ğ","Rnlf","²ñ","Rnla","²ò","Rnlq","²ó","Rb","²ô","Rm",
			"²õ","Rmr","²ö","Rms","²÷","Rmsg","²ø","Rmf","²ù","Rmfa","²ú","Rmfg","²û","Rma","²ü","Rmq","²ı","Rmt","²ş","Rmd",
			"³¡","Rmx","³¢","Rl","³£","Rlr","³¤","Rls","³¥","Rlf","³¦","Rla","³§","Rlq","³¨","Rlt","³©","Rld","³ª","sk",
			"³«","skr","³¬","skR","³­","sks","³®","ske","³¯","skf","³°","skfr","³±","skfa","³²","ska","³³","skq","³´","skt",
			"³µ","skT","³¶","skd","³·","skw","³¸","skc","³¹","skx","³º","skg","³»","so","³¼","sor","³½","sos","³¾","sof",
			"³¿","soa","³À","soq","³Á","sot","³Â","soT","³Ã","sod","³Ä","si","³Å","sir","³Æ","sis","³Ç","sif","³È","sia",
			"³É","sid","³Ê","sj","³Ë","sjr","³Ì","sjt","³Í","sjs","³Î","sjf","³Ï","sjfa","³Ğ","sjfq","³Ñ","sja","³Ò","sjq",
			"³Ó","sjt","³Ô","sjT","³Õ","sjd","³Ö","sjg","³×","sp","³Ø","spr","³Ù","sps","³Ú","spf","³Û","spa","³Ü","spq",
			"³İ","spt","³Ş","spT","³ß","spd","³à","su","³á","sur","³â","sus","³ã","suf","³ä","sua","³å","suq","³æ","suT",
			"³ç","sud","³è","suz","³é","sP","³ê","sPs","³ë","sh","³ì","shr","³í","shs","³î","shf","³ï","shfa","³ğ","sha",
			"³ñ","shq","³ò","sht","³ó","shd","³ô","shv","³õ","shg","³ö","shk","³÷","shks","³ø","shkf","³ù","shkT","³ú","shl",
			"³û","shls","³ü","shlf","³ı","shla","³ş","shlq","´¡","shlt","´¢","sy","´£","syr","´¤","sys","´¥","syf","´¦","syq",
			"´§","syt","´¨","syd","´©","sn","´ª","snr","´«","sns","´¬","sne","´­","snf","´®","sna","´¯","snq","´°","snt",
			"´±","snd","´²","snj","´³","snjT","´´","snp","´µ","snl","´¶","snls","´·","snlf","´¸","snla","´¹","snlq","´º","sb",
			"´»","sbr","´¼","sbf","´½","sba","´¾","sbq","´¿","sbd","´À","sm","´Á","smr","´Â","sms","´Ã","smf","´Ä","smfr",
			"´Å","smfa","´Æ","sma","´Ç","smq","´È","smt","´É","smd","´Ê","smw","´Ë","smv","´Ì","sml","´Í","smls","´Î","smlf",
			"´Ï","sl","´Ğ","slr","´Ñ","sls","´Ò","slf","´Ó","slfa","´Ô","sla","´Õ","slq","´Ö","slt","´×","sld","´Ø","slv",
			"´Ù","ek","´Ú","ekr","´Û","ekR","´Ü","eks","´İ","eke","´Ş","ekf","´ß","ekfr","´à","ekfa","´á","ekfq","´â","ekfg",
			"´ã","eka","´ä","ekq","´å","ekt","´æ","ekT","´ç","ekd","´è","ekw","´é","ekc","´ê","ekg","´ë","eo","´ì","eor",
			"´í","eos","´î","eof","´ï","eoa","´ğ","eoq","´ñ","eot","´ò","eoT","´ó","eod","´ô","ei","´õ","ej","´ö","ejr",
			"´÷","ejR","´ø","ejs","´ù","eje","´ú","ejf","´û","ejfa","´ü","ejfq","´ı","eja","´ş","ejq","µ¡","ejt","µ¢","ejd",
			"µ£","ejc","µ¤","ejv","µ¥","ep","µ¦","epr","µ§","eps","µ¨","epf","µ©","epa","µª","epq","µ«","ept","µ¬","epT",
			"µ­","epd","µ®","eu","µ¯","eus","µ°","euf","µ±","euT","µ²","eud","µ³","eP","µ´","ePs","µµ","eh","µ¶","ehr",
			"µ·","ehs","µ¸","ehe","µ¹","ehf","µº","ehfa","µ»","ehft","µ¼","eha","µ½","ehq","µ¾","eht","µ¿","ehd","µÀ","ehc",
			"µÁ","ehx","µÂ","ehk","µÃ","ehks","µÄ","ehkf","µÅ","eho","µÆ","ehoT","µÇ","ehl","µÈ","ehls","µÉ","ehlf","µÊ","ehla",
			"µË","ehlq","µÌ","ehlt","µÍ","ey","µÎ","en","µÏ","enr","µĞ","ens","µÑ","enf","µÒ","ena","µÓ","enq","µÔ","ent",
			"µÕ","end","µÖ","enj","µ×","enjT","µØ","enp","µÙ","enpd","µÚ","enl","µÛ","enls","µÜ","enlf","µİ","enlq","µŞ","enlt",
			"µß","enld","µà","eb","µá","ens","µâ","enf","µã","ena","µä","end","µå","em","µæ","emr","µç","ems","µè","eme",
			"µé","emf","µê","emfa","µë","ema","µì","emq","µí","emt","µî","emd","µï","eml","µğ","el","µñ","elr","µò","els",
			"µó","ele","µô","elf","µõ","ela","µö","elq","µ÷","elt","µø","elT","µù","eld","µú","elw","µû","Ek","µü","Ekr",
			"µı","Eks","µş","Ekf","¶¡","Eka","¶¢","Ekq","¶£","Ekt","¶¤","EkT","¶¥","Ekd","¶¦","Ekg","¶§","Eo","¶¨","Eor",
			"¶©","Eos","¶ª","Eof","¶«","Eoa","¶¬","Eoq","¶­","Eot","¶®","EoT","¶¯","Eod","¶°","Ej","¶±","Ejr","¶²","Ejs",
			"¶³","Ejf","¶´","Ejfa","¶µ","Ejfq","¶¶","Eja","¶·","Ejq","¶¸","Ejt","¶¹","EjT","¶º","Ejd","¶»","Ejg","¶¼","Ep",
			"¶½","Epr","¶¾","Eps","¶¿","Epf","¶À","Epa","¶Á","Epq","¶Â","Ept","¶Ã","EpT","¶Ä","Epd","¶Å","Eu","¶Æ","EuT",
			"¶Ç","Eh","¶È","Ehr","¶É","Ehs","¶Ê","Ehf","¶Ë","Ehd","¶Ì","Ehk","¶Í","Ehkf","¶Î","Eho","¶Ï","Ehl","¶Ğ","Ehls",
			"¶Ñ","En","¶Ò","Enr","¶Ó","Ens","¶Ô","Enf","¶Õ","Enfg","¶Ö","Ena","¶×","End","¶Ø","Enp","¶Ù","Enl","¶Ú","Enls",
			"¶Û","Enlf","¶Ü","Enla","¶İ","Enlq","¶Ş","Enld","¶ß","Em","¶à","Emr","¶á","Ems","¶â","Eme","¶ã","Emf","¶ä","Ema",
			"¶å","Emq","¶æ","Emt","¶ç","Eml","¶è","Emls","¶é","Emlf","¶ê","Emla","¶ë","Emlq","¶ì","El","¶í","Els","¶î","Elf",
			"¶ï","Ela","¶ğ","Elq","¶ñ","Elt","¶ò","Eld","¶ó","fk","¶ô","fkr","¶õ","fks","¶ö","fkf","¶÷","fka","¶ø","fkq",
			"¶ù","fkt","¶ú","fkT","¶û","fkd","¶ü","fkw","¶ı","fkv","¶ş","fkg","·¡","fo","·¢","for","·£","fos","·¤","fof",
			"·¥","foa","·¦","foq","·§","fot","·¨","foT","·©","fod","·ª","fi","·«","fir","·¬","fis","·­","fit","·®","fid",
			"·¯","fj","·°","fjr","·±","fjs","·²","fjf","·³","fja","·´","fjq","·µ","fjt","·¶","fjT","··","fjd","·¸","fjg",
			"·¹","fp","·º","fpr","·»","fps","·¼","fpf","·½","fpa","·¾","fpq","·¿","fpt","·À","fpd","·Á","fu","·Â","fur",
			"·Ã","fus","·Ä","fuf","·Å","fua","·Æ","fuq","·Ç","fut","·È","fuT","·É","fud","·Ê","fP","·Ë","fPs","·Ì","fPq",
			"·Í","fPt","·Î","fh","·Ï","fhr","·Ğ","fhs","·Ñ","fhf","·Ò","fha","·Ó","fhq","·Ô","fht","·Õ","fhd","·Ö","fhk",
			"·×","fhks","·Ø","fhkd","·Ù","fhoT","·Ú","fhl","·Û","fhls","·Ü","fhlf","·İ","fhla","·Ş","fhlq","·ß","fhlt","·à","fhld",
			"·á","fy","·â","fys","·ã","fyf","·ä","fyq","·å","fyt","·æ","fyd","·ç","fn","·è","fnr","·é","fns","·ê","fnf",
			"·ë","fna","·ì","fnq","·í","fnt","·î","fnd","·ï","fnj","·ğ","fnjT","·ñ","fnp","·ò","fnl","·ó","fnlr","·ô","fnls",
			"·õ","fnlf","·ö","fnla","·÷","fnlt","·ø","fnld","·ù","fb","·ú","fbr","·û","fbs","·ü","fbf","·ı","fba","·ş","fbq",
			"¸¡","fbt","¸¢","fbd","¸£","fm","¸¤","fmr","¸¥","fms","¸¦","fmf","¸§","fma","¸¨","fmq","¸©","fmt","¸ª","fmd",
			"¸«","fmw","¸¬","fmx","¸­","fmv","¸®","fl","¸¯","flr","¸°","fls","¸±","flf","¸²","fla","¸³","flq","¸´","flt",
			"¸µ","fld","¸¶","ak","¸·","akr","¸¸","aks","¸¹","aksg","¸º","ake","¸»","akf","¸¼","akfr","¸½","aka","¸¾","aka",
			"¸¿","akq","¸À","akt","¸Á","akd","¸Â","akw","¸Ã","akx","¸Ä","akg","¸Å","ao","¸Æ","aor","¸Ç","aos","¸È","aof","¸É","aoa",
			"¸Ê","aoq","¸Ë","aot","¸Ì","aoT","¸Í","aod","¸Î","aow","¸Ï","ai","¸Ğ","air","¸Ñ","aif","¸Ò","aid","¸Ó","aj","¸Ô","ajr",
			"¸Õ","ajs","¸Ö","ajf","¸×","ajfa","¸Ø","aja","¸Ù","ajq","¸Ú","ajt","¸Û","ajd","¸Ü","ajw","¸İ","ajg","¸Ş","ap","¸ß","apr",
			"¸à","aps","¸á","apf","¸â","apa","¸ã","apq","¸ä","apt","¸å","apT","¸æ","apd","¸ç","au","¸è","aur","¸é","aus",
			"¸ê","auf","¸ë","aut","¸ì","auT","¸í","aud","¸î","auc","¸ï","aP","¸ğ","ah","¸ñ","ahr","¸ò","ahrt","¸ó","ahs","¸ô","ahf",
			"¸õ","ahfa","¸ö","aha","¸÷","ahq","¸ø","aht","¸ù","ahd","¸ú","ahk","¸û","ahks","¸ü","ahkT","¸ı","ahkd","¸ş","ahl","¹¡","ahls",
			"¹¢","ahlf","¹£","ahlq","¹¤","ahlt","¹¥","ahld","¹¦","ay","¹§","ays","¹¨","ayf","¹©","ayq","¹ª","ayt","¹«","an","¹¬","anr",
			"¹­","anR","¹®","ans","¹¯","ane","¹°","anf","¹±","anfr","¹²","anfa","¹³","ana","¹´","anq","¹µ","ant","¹¶","and",
			"¹·","anx","¹¸","ang","¹¹","anj","¹º","anjs","¹»","anjf","¹¼","anjq","¹½","anjt","¹¾","anp","¹¿","anl","¹À","anls","¹Á","anlf",
			"¹Â","ab","¹Ã","abs","¹Ä","abf","¹Å","aba","¹Æ","abt","¹Ç","am","¹È","ams","¹É","amf","¹Ê","ama","¹Ë","amt","¹Ì","al",
			"¹Í","alr","¹Î","als","¹Ï","ale","¹Ğ","alf","¹Ñ","alfa","¹Ò","ala","¹Ó","alq","¹Ô","alt","¹Õ","alT","¹Ö","ald","¹×","alC",
			"¹Ø","alx","¹Ù","qk","¹Ú","qkr","¹Û","qkR","¹Ü","qkrt","¹İ","qks","¹Ş","qke","¹ß","qkf","¹à","qkfr","¹á","qkfa",
			"¹â","qkfq","¹ã","qka","¹ä","qkq","¹å","qkt","¹æ","qkd","¹ç","qkx","¹è","qo","¹é","qor","¹ê","qos","¹ë","qof","¹ì","qoa",
			"¹í","qoq","¹î","qot","¹ï","qoT","¹ğ","qod","¹ñ","qox","¹ò","qi","¹ó","qir","¹ô","qis","¹õ","qiq","¹ö","qj","¹÷","qjr",
			"¹ø","qjs","¹ù","qje","¹ú","qjf","¹û","qjfa","¹ü","qja","¹ı","qjq","¹ş","qjt","º¡","qjd","º¢","qjw","º£","qp","º¤","qpr",
			"º¥","qps","º¦","qpe","º§","qpf","º¨","qpa","º©","qpq","ºª","qpt","º«","qpT","º¬","qpd","º­","qu","º®","qur",
			"º¯","qus","º°","quf","º±","quq","º²","qut","º³","quT","º´","qud","ºµ","qux","º¶","qP","º·","qPs","º¸","qh","º¹","qhr",
			"ºº","qhR","º»","qhs","º¼","qhf","º½","qha","º¾","qhq","º¿","qht","ºÀ","qhd","ºÁ","qhk","ºÂ","qhks","ºÃ","qhkT","ºÄ","qho",
			"ºÅ","qhoT","ºÆ","qhl","ºÇ","qhlr","ºÈ","qhls","ºÉ","qhlf","ºÊ","qhla","ºË","qhlq","ºÌ","qy","ºÍ","qys","ºÎ","qn","ºÏ","qnr",
			"ºĞ","qns","ºÑ","qne","ºÒ","qnf","ºÓ","qnfr","ºÔ","qnfa","ºÕ","qna","ºÖ","qnq","º×","qnt","ºØ","qnd","ºÙ","qnx",
			"ºÚ","qnv","ºÛ","qnj","ºÜ","qnjf","ºİ","qnjT","ºŞ","qnp","”í","qnpf","”î","qnpfr","ºß","qnl","ºà","qnlr","ºá","qnls","ºâ","qnlf","ºã","qnld","ºä","qb",
			"ºå","qbs","ºæ","qbf","ºç","qba","ºè","qbt","ºé","qbd","ºê","qm","ºë","qmr","ºì","qms","ºí","qmf","ºî","qma","ºï","qmq",
			"ºğ","qmt","ºñ","ql","ºò","qlr","ºó","qls","ºô","qlf","ºõ","qlfa","ºö","qla","º÷","qlq","ºø","qlt","ºù","qld","ºú","qlw",
			"ºû","qlc","ºü","Qk","ºı","Qkr","ºş","Qks","»¡","Qkf","»¢","Qkfa","»£","Qka","»¤","Qkq","»¥","Qkt","»¦","QkT",
			"»§","Qkd","»¨","Qkg","»©","Qo","»ª","Qor","»«","Qos","»¬","Qof","»­","Qoa","»®","Qoq","»¯","Qot","»°","QoT","»±","Qod",
			"»²","Qi","»³","Qir","»´","Qia","»µ","Qj","»¶","Qjr","»·","Qjs","»¸","Qje","»¹","Qjf","»º","Qja","»»","Qjt","»¼","QjT",
			"»½","Qjd","»¾","Qp","»¿","Qpd","»À","Qu","»Á","Qur","»Â","Qua","»Ã","Quq","»Ä","Qut","»Å","QuT","»Æ","Qud","»Ç","Qh",
			"»È","Qhr","»É","Qhs","»Ê","Qhf","»Ë","Qha","»Ì","Qhq","»Í","Qhd","»Î","Qhl","»Ï","Qy","»Ğ","Qyd","»Ñ","Qn",
			"»Ò","Qnr","»Ó","Qns","»Ô","Qnf","»Õ","Qna","»Ö","Qnt","»×","Qnd","»Ø","Qb","»Ù","Qbd","»Ú","Qm","»Û","Qms","»Ü","Qmf",
			"»İ","Qma","»Ş","Qmq","»ß","Ql","»à","Qlr","»á","Qls","»â","Qlf","»ã","Qla","»ä","Qlq","»å","Qlt","»æ","Qld","»ç","tk",
			"»è","tkr","»é","tkrt","»ê","tks","»ë","tke","»ì","tkf","»í","tkfr","»î","tkfa","»ï","tka","»ğ","tkq","»ñ","tkt","»ò","tkT",
			"»ó","tkd","»ô","tkx","»õ","to","»ö","tor","»÷","tos","»ø","tof","»ù","toa","»ú","toq","»û","tot","»ü","toT",
			"»ı","tod","»ş","ti","¼¡","tir","¼¢","tis","¼£","tif","¼¤","tia","¼¥","tiq","¼¦","tit","¼§","tid","¼¨","tO",
			"¼©","tOs","¼ª","tOf","¼«","tOa","¼¬","tOd","¼­","tj","¼®","tjr","¼¯","tjR","¼°","tjrt","¼±","tjs","¼²","tje",
			"¼³","tjf","¼´","tjfa","¼µ","tjfq","¼¶","tja","¼·","tjq","¼¸","tjt","¼¹","tjT","¼º","tjd","¼»","tjv","¼¼","tp",
			"¼½","tpR","¼¾","tps","¼¿","tpf","¼À","tpa","¼Á","tpq","¼Â","tpt","¼Ã","tpT","¼Ä","tpd","¼Å","tu","¼Æ","tur",
			"¼Ç","tus","¼È","tuf","¼É","tua","¼Ê","tuq","¼Ë","tut","¼Ì","tuT","¼Í","tud","¼Î","tP","¼Ï","tPs","¼Ğ","tPf",
			"¼Ñ","tPd","¼Ò","th","¼Ó","thr","¼Ô","thR","¼Õ","ths","¼Ö","thf","¼×","thfa","¼Ø","tha","¼Ù","thq","¼Ú","tht",
			"¼Û","thd","¼Ü","thx","¼İ","thk","¼Ş","thkr","¼ß","thks","¼à","thkf","¼á","thkd","¼â","tho","¼ã","thos","¼ä","thof",
			"¼å","thoa","¼æ","thot","¼ç","thoT","¼è","thl","¼é","thls","¼ê","thlf","¼ë","thla","¼ì","thlq","¼í","thlt","¼î","ty",
			"¼ï","tyr","¼ğ","tys","¼ñ","tyf","¼ò","tya","¼ó","tyq","¼ô","tyt","¼õ","tyd","¼ö","tn","¼÷","tnr","¼ø","tns",
			"¼ù","tne","¼ú","tnf","¼û","tna","¼ü","tnq","¼ı","tnt","¼ş","tnd","½¡","tnc","½¢","tnx","½£","tnv","½¤","tnj",
			"½¥","tnjT","½¦","tnp","½§","tnpr","½¨","tnps","½©","tnpf","½ª","tnpa","½«","tnpd","½¬","tnl","½­","tnlr","½®","tnls",
			"½¯","tnlf","½°","tnla","½±","tnlq","½²","tnlt","½³","tnld","½´","tb","½µ","tbr","½¶","tbf","½·","tba","½¸","tbt",
			"½¹","tbd","½º","tm","½»","tmr","½¼","tms","½½","tmf","½¾","tmfr","½¿","tma","½À","tmq","½Á","tmt","½Â","tmd",
			"½Ã","tl","½Ä","tlr","½Å","tls","½Æ","tle","½Ç","tlf","½È","tlfg","½É","tla","½Ê","tlq","½Ë","tlt","½Ì","tld",
			"½Í","tlv","½Î","Tk","½Ï","Tkr","½Ğ","Tkrt","½Ñ","Tks","½Ò","Tkf","½Ó","Tka","½Ô","Tkq","½Õ","TkT","½Ö","Tkd",
			"½×","Tkg","½Ø","To","½Ù","Tor","½Ú","Tos","½Û","Tof","½Ü","Toa","½İ","Toq","½Ş","ToT","½ß","Tod","½à","Tid",
			"½á","Tj","½â","Tjr","½ã","Tjs","½ä","Tjf","½å","Tjfa","½æ","Tja","½ç","Tjq","½è","TjT","½é","Tjd","½ê","Tp",
			"›®","Tpr","½ë","Tps","½ì","Tpf","½í","TPs","½î","Th","½ï","Thr","½ğ","Ths","½ñ","The","½ò","Thf","½ó","Thfa",
			"½ô","Tha","½õ","Thq","½ö","Thd","½÷","Thk","½ø","Thkr","½ù","Thks","½ú","ThkT","½û","Tho","½ü","ThoT","½ı","Thl",
			"½ş","Thls","¾¡","Thlf","¾¢","Thla","¾£","Thlq","¾¤","Ty","¾¥","Tn","¾¦","Tnr","¾§","Tns","¾¨","Tnf","¾©","Tna",
			"¾ª","Tnq","¾«","Tnd","¾¬","Tnj","¾­","TnT","¾®","Tnp","¾¯","Tnl","¾°","Tnls","¾±","Tbd","¾²","Tm","¾³","Tmr",
			"¾´","Tms","¾µ","Tmf","¾¶","Tmfa","¾·","Tmfg","¾¸","Tma","¾¹","Tmq","¾º","Tml","¾»","Tmls","¾¼","Tmlf","¾½","Tmla",
			"¾¾","Tl","¾¿","Tlr","¾À","Tls","¾Á","Tlf","¾Â","Tla","¾Ã","Tlq","¾Ä","Tlt","¾Å","Tld","¾Æ","dk","¾Ç","dkr",
			"¾È","dks","¾É","dksw","¾Ê","dksg","¾Ë","dkf","¾Ì","dkfr","¾Í","dkfa","¾Î","dkfg","¾Ï","dka","¾Ğ","dkq","¾Ñ","dkt",
			"¾Ò","dkT","¾Ó","dkd","¾Ô","dkx","¾Õ","dkv","¾Ö","do","¾×","dor","¾Ø","dos","¾Ù","dof","¾Ú","doa","¾Û","doq",
			"¾Ü","dot","¾İ","doT","¾Ş","dod","¾ß","di","¾à","dir","¾á","dis","¾â","dif","¾ã","difq","¾ä","dia","¾å","diq",
			"¾æ","dit","¾ç","did","¾è","dix","¾é","dig","¾ê","dO","¾ë","dOs","¾ì","dOf","¾í","dOq","¾î","dj","¾ï","djr",
			"¾ğ","djs","¾ñ","djsw","¾ò","dje","¾ó","djf","¾ô","djfr","¾õ","djfa","¾ö","dja","¾÷","djq","¾ø","djqt","¾ù","djt",
			"¾ú","djT","¾û","djd","¾ü","djw","¾ı","djz","¾ş","djv","¿¡","dp","¿¢","dpr","¿£","dps","¿¤","dpf","¿¥","dpa",
			"¿¦","dpq","¿§","dpt","¿¨","dpd","¿©","du","¿ª","dur","¿«","duR","¿¬","dus","¿­","duf","¿®","dufa","¿¯","dufq",
			"¿°","dua","¿±","duq","¿²","duqt","¿³","dut","¿´","duT","¿µ","dud","¿¶","dux","¿·","duv","¿¸","dug","¿¹","dP",
			"¿º","dPs","¿»","dPf","¿¼","dPa","¿½","dPq","¿¾","dPt","¿¿","dPT","¿À","dh","¿Á","dhr","¿Â","dhs","¿Ã","dhf",
			"¿Ä","dhfr","¿Å","dhfa","¿Æ","dhft","¿Ç","dhfg","¿È","dha","¿É","dhq","¿Ê","dht","¿Ë","dhd","¿Ì","dhc","¿Í","dhk",
			"¿Î","dhkr","¿Ï","dhks","¿Ğ","dhkf","¿Ñ","dhka","¿Ò","dhkq","¿Ó","dhkt","¿Ô","dhkT","¿Õ","dhkd","¿Ö","dho","¿×","dhor",
			"¿Ø","dhos","¿Ù","dhoa","¿Ú","dhot","¿Û","dhod","¿Ü","dhl","¿İ","dhlr","¿Ş","dhls","¿ß","dhlf","¿à","dhla","¿á","dhlq",
			"¿â","dhlt","¿ã","dhld","¿ä","dy","¿å","dyr","¿æ","dys","¿ç","dyf","¿è","dya","¿é","dyq","¿ê","dyr","¿ë","dyd",
			"¿ì","dn","¿í","dnr","¿î","dns","¿ï","dnf","¿ğ","dnfr","¿ñ","dnfa","¿ò","dna","¿ó","dnq","¿ô","dnt","¿õ","dnd",
			"¿ö","dnj","¿÷","dnjr","¿ø","dnjs","¿ù","dnjf","¿ú","dnja","¿û","dnjq","¿ü","dnjT","¿ı","dnjd","¿ş","dnp","À¡","dnpr",
			"À¢","dnps","À£","dnpf","À¤","dnpa","À¥","dnpq","À¦","dnpd","À§","dnl","À¨","dnlr","À©","dnls","Àª","dnlf","À«","dnla",
			"À¬","dnlq","À­","dnlt","À®","dnld","À¯","db","À°","dbr","À±","dbs","À²","dbf","À³","dba","À´","dbq","Àµ","dbt",
			"À¶","dbd","À·","dbc","À¸","dm","À¹","dmr","Àº","dms","À»","dmf","À¼","dmfv","À½","dma","À¾","dnq","À¿","dmt",
			"ÀÀ","dmd","ÀÁ","dmw","ÀÂ","dmc","ÀÃ","dmz","ÀÄ","dmx","ÀÅ","dmv","ÀÆ","dmg","ÀÇ","dml","ÀÈ","dmls","ÀÉ","dmlf",
			"ÀÊ","dmla","ÀË","dmlt","ÀÌ","dl","ÀÍ","dlr","ÀÎ","dls","ÀÏ","dlf","ÀĞ","dlfr","ÀÑ","dlfa","ÀÒ","dlfg","ÀÓ","dla",
			"ÀÔ","dlq","ÀÕ","dlt","ÀÖ","dlT","À×","dld","ÀØ","dlw","ÀÙ","dlv","ÀÚ","wk","ÀÛ","wkr","ÀÜ","wks","Àİ","wksg",
			"ÀŞ","wke","Àß","wkf","Àà","wkfa","Àá","wka","Àâ","wkq","Àã","wkt","Àä","wkT","Àå","wkd","Àæ","wkw","Àç","wo",
			"Àè","wor","Àé","wos","Àê","wof","Àë","woa","Àì","woq","Àí","wot","Àî","woT","Àï","wod","Àğ","wi","Àñ","wir",
			"Àò","wis","Àó","wisg","Àô","wif","Àõ","wia","Àö","wid","À÷","wO","Àø","wOs","Àù","wOf","Àú","wj","Àû","wjr",
			"Àü","wjs","Àı","wjf","Àş","wjfa","Á¡","wja","Á¢","wjq","Á£","wjt","Á¤","wjd","Á¥","wjw","Á¦","wp","Á§","wpr",
			"Á¨","wps","Á©","wpf","Áª","wpa","Á«","wpq","Á¬","wpt","Á­","wpd","Á®","wu","Á¯","wus","Á°","wuf","Á±","wua",
			"Á²","wuq","Á³","wuT","Á´","wud","Áµ","wP","Á¶","wh","Á·","whr","Á¸","whs","Á¹","whf","Áº","whfa","Á»","wha",
			"Á¼","whq","Á½","wht","Á¾","whd","Á¿","whw","ÁÀ","whc","ÁÁ","whg","ÁÂ","whk","ÁÃ","whkr","ÁÄ","whkf","ÁÅ","whkq",
			"ÁÆ","whkt","ÁÇ","whkd","ÁÈ","who","ÁÉ","whoT","ÁÊ","whod","ÁË","whl","ÁÌ","whls","ÁÍ","whlf","ÁÎ","whla","ÁÏ","whlq",
			"ÁĞ","whlt","ÁÑ","whld","ÁÒ","wy","ÁÓ","wyr","ÁÔ","wys","ÁÕ","wyd","ÁÖ","wn","Á×","wnr","ÁØ","wns","ÁÙ","wnf",
			"ÁÚ","wnfr","ÁÛ","wnfa","ÁÜ","wna","Áİ","wnq","ÁŞ","wnt","Áß","wnd","Áà","wnj","Áá","wnjT","Áâ","wnp","Áã","wnl",
			"Áä","wnlr","Áå","wnls","Áæ","wnlf","Áç","wnla","Áè","wnlq","Áé","wnlt","Áê","wb","Áë","wbs","Áì","wbf","Áí","wba",
			"Áî","wm","Áï","wmr","Áğ","wms","Áñ","wmf","Áò","wma","Áó","wmq","Áô","wmt","Áõ","wmd","Áö","wl","Á÷","wlr",
			"Áø","wls","Áù","wle","Áú","wlf","Áû","wlfa","Áü","wla","Áı","wlq","Áş","wlt","Â¡","wld","Â¢","wlw","Â£","wlx",
			"Â¤","wlv","Â¥","Wk","Â¦","Wkr","Â§","Wks","Â¨","Wksg","Â©","Wkf","Âª","Wkfq","Â«","Wka","Â¬","Wkq","Â­","Wkt",
			"Â®","WkT","Â¯","Wkd","Â°","Wo","Â±","Wor","Â²","Wos","Â³","Wof","Â´","Woa","Âµ","Woq","Â¶","Wot","Â·","WoT",
			"Â¸","Wod","Â¹","Wi","Âº","Wis","Â»","Wid","Â¼","Wj","Â½","Wjr","Â¾","Wjs","Â¿","Wjf","ÂÀ","Wja","ÂÁ","Wjq",
			"ÂÂ","Wjt","ÂÃ","WjT","ÂÄ","Wjd","ÂÅ","Wp","ÂÆ","Wpd","ÂÇ","Wu","ÂÈ","WuT","ÂÉ","Wh","ÂÊ","Whr","ÂË","Whs",
			"ÂÌ","Whf","ÂÍ","Wha","ÂÎ","Whq","ÂÏ","Wht","ÂĞ","Whd","ÂÑ","Whc","ÂÒ","Whk","ÂÓ","Whkr","ÂÔ","Whkf","ÂÕ","WhkT",
			"ÂÖ","Who","Â×","WhoT","ÂØ","Whl","ÂÙ","Whls","ÂÚ","Whlf","ÂÛ","Whla","ÂÜ","Whlq","Âİ","Wyd","ÂŞ","Wn","Âß","Wnr",
			"Âà","Wns","Âá","Wnf","Ââ","Wna","Âã","Wnq","Âä","Wnd","Âå","Wnj","Âæ","WnjT","Âç","Wnjd","Âè","Wnl","Âé","Wb",
			"Âê","Wm","Âë","Wma","Âì","Wmt","Âí","Wmd","Âî","Wl","Âï","Wlr","Âğ","Wls","Âñ","Wlf","Âò","Wla","Âó","Wlq",
			"Âô","Wld","Âõ","Wlw","Âö","Wlg","Â÷","ck","Âø","ckr","Âù","cks","Âú","cksg","Âû","ckf","Âü","cka","Âı","ckq",
			"Âş","ckt","Ã¡","ckT","Ã¢","ckd","Ã£","ckw","Ã¤","co","Ã¥","cor","Ã¦","cos","Ã§","cof","Ã¨","coa","Ã©","coq",
			"Ãª","cot","Ã«","coT","Ã¬","cod","Ã­","ci","Ã®","cis","Ã¯","cisg","Ã°","cif","Ã±","cia","Ã²","cid","Ã³","cj",
			"Ã´","cjr","Ãµ","cjs","Ã¶","cjf","Ã·","cja","Ã¸","cjq","Ã¹","cjt","Ãº","cjT","Ã»","cjd","Ã¼","cp","Ã½","cpr",
			"Ã¾","cps","Ã¿","cpf","ÃÀ","cpa","ÃÁ","cpq","ÃÂ","cpt","ÃÃ","cpd","ÃÄ","cu","ÃÅ","cus","ÃÆ","cuT","ÃÇ","cP",
			"ÃÈ","cPs","ÃÉ","cPd","ÃÊ","ch","ÃË","chr","ÃÌ","chs","ÃÍ","chf","ÃÎ","cha","ÃÏ","chq","ÃĞ","cht","ÃÑ","cha",
			"ÃÒ","chk","ÃÓ","chks","ÃÔ","chkf","ÃÕ","chkd","ÃÖ","chl","Ã×","chls","ÃØ","chlf","ÃÙ","chla","ÃÚ","chlq","ÃÛ","chlt",
			"ÃÜ","chld","Ãİ","cy","ÃŞ","cya","­h","cyq","Ãß","cn","Ãà","cnr","Ãá","cns","Ãâ","cnf","Ãã","cna","Ãä","cnq",
			"Ãå","cnt","Ãæ","cnd","Ãç","cnj","Ãè","cnjT","Ãé","cnp","Ãê","cnps","®X","cnpt","Ãë","cnl","Ãì","cnls","Ãí","cnlf",
			"Ãî","cnla","Ãï","cnlq","Ãğ","cnlt","Ãñ","cnld","Ãò","cb","Ãó","cbs","Ãô","cbf","Ãõ","cba","Ãö","cbd","Ã÷","cm",
			"Ãø","cmr","Ãù","cms","Ãú","cmf","Ãû","cma","Ãü","cmq","Ãı","cmt","Ãş","cmd","Ä¡","cl","Ä¢","clr","Ä£","cls",
			"Ä¤","cle","Ä¥","clf","Ä¦","clfr","Ä§","cla","Ä¨","clq","Ä©","clt","Äª","cld","Ä«","zk","Ä¬","zkr","Ä­","zks",
			"Ä®","zkf","Ä¯","zka","Ä°","zkq","Ä±","zkt","Ä²","zkd","Ä³","zo","Ä´","zor","Äµ","zos","Ä¶","zof","Ä·","zoa",
			"Ä¸","zoq","Ä¹","zot","Äº","zoT","Ä»","zod","Ä¼","zi","Ä½","zir","Ä¾","zid","Ä¿","zj","ÄÀ","zjr","ÄÁ","zjs",
			"ÄÂ","zje","ÄÃ","zjf","ÄÄ","zja","ÄÅ","zjq","ÄÆ","zjt","ÄÇ","zjT","ÄÈ","zjd","ÄÉ","zp","ÄÊ","zp","ÄË","zps",
			"ÄÌ","zpf","ÄÍ","zpa","ÄÎ","zpq","ÄÏ","zpt","ÄĞ","zpd","ÄÑ","zu","ÄÒ","zus","ÄÓ","zuf","ÄÔ","zua","ÄÕ","zuq",
			"ÄÖ","zut","Ä×","zuT","ÄØ","zud","ÄÙ","zP","ÄÚ","zh","ÄÛ","zhr","ÄÜ","zhs","Äİ","zhf","ÄŞ","zha","Äß","zhq",
			"Äà","zht","Äá","zhd","Äâ","zhk","Äã","zhkr","Ää","zhks","Äå","zhkf","Äæ","zhka","Äç","zhkd","Äè","zho","Äé","zhod",
			"Äê","zhl","Äë","zhlf","Äì","zy","Äí","zn","Äî","znr","Äï","zns","Äğ","znf","Äñ","zna","Äò","znq","Äó","znt",
			"Äô","znd","Äõ","znj","Äö","znjs","Ä÷","znjf","Äø","znjd","Äù","znp","Äú","znpd","Äû","znl","Äü","znlr","Äı","znls",
			"Äş","znlf","Å¡","znla","Å¢","znlq","Å£","znlt","Å¤","znld","Å¥","zb","Å¦","zbs","Å§","zbf","Å¨","zba","Å©","zm",
			"Åª","zmr","Å«","zms","Å¬","zmf","Å­","zma","Å®","zmq","Å¯","zmd","Å°","zl","Å±","zlr","Å²","zls","Å³","zlf",
			"Å´","zla","Åµ","zlq","Å¶","zlt","Å·","zld","Å¸","xk","Å¹","xkr","Åº","xks","Å»","xkf","Å¼","xkfr","Å½","xka",
			"Å¾","xkq","Å¿","xkt","ÅÀ","xkT","ÅÁ","xkd","ÅÂ","xo","ÅÃ","xor","ÅÄ","xos","ÅÅ","xof","ÅÆ","xoa","ÅÇ","xoq",
			"ÅÈ","xot","ÅÉ","xoT","ÅÊ","xod","ÅË","xi","ÅÌ","xid","ÅÍ","xj","ÅÎ","xjr","ÅÏ","xjs","ÅĞ","xjf","ÅÑ","xjfa",
			"ÅÒ","xja","ÅÓ","xjq","ÅÔ","xjt","ÅÕ","xjT","ÅÖ","xjd","Å×","xp","ÅØ","xpr","ÅÙ","xps","ÅÚ","xpf","ÅÛ","xpa",
			"ÅÜ","xpq","Åİ","xpt","ÅŞ","xpd","Åß","xu","Åà","xus","Åá","xuT","Åâ","xP","Åã","xPs","Åä","xh","Åå","xhr",
			"Åæ","xhs","Åç","xhf","Åè","xha","Åé","xhq","Åê","xht","Åë","xhd","Åì","xhv","Åí","xhk","Åî","xhks","Åï","xho",
			"Åğ","xhl","Åñ","xhls","Åò","xhlt","Åó","xhld","Åô","xy","Åõ","xn","Åö","xnr","Å÷","xns","Åø","xnf","Åù","xna",
			"Åú","xnq","Åû","xnt","Åü","xnd","Åı","xnj","Åş","xnjT","Æ¡","xnp","Æ¢","xnl","Æ£","xnlr","Æ¤","xnls","Æ¥","xnlf",
			"Æ¦","xnla","Æ§","xnlq","Æ¨","xnld","Æ©","xb","Æª","xbs","Æ«","xb","Æ¬","xba","Æ­","xbd","Æ®","xm","Æ¯","xmr",
			"Æ°","xms","Æ±","xme","Æ²","xmf","Æ³","xmfa","Æ´","xma","Æµ","xmq","Æ¶","xmt","Æ·","xml","Æ¸","xls","Æ¹","xmlf",
			"Æº","xmla","Æ»","xmlq","Æ¼","xl","Æ½","xlr","Æ¾","xls","Æ¿","xlf","ÆÀ","xla","ÆÁ","xlq","ÆÂ","xlt","ÆÃ","xld",
			"ÆÄ","vk","ÆÅ","vkr","ÆÆ","vkR","ÆÇ","vks","ÆÈ","vkf","ÆÉ","vkfa","ÆÊ","vka","ÆË","vkq","ÆÌ","vkt","ÆÍ","vkT",
			"ÆÎ","vkd","ÆÏ","vkx","ÆĞ","vko","ÆÑ","vor","ÆÒ","vos","ÆÓ","vof","ÆÔ","voa","ÆÕ","voq","ÆÖ","vot","Æ×","voT",
			"ÆØ","vod","ÆÙ","vi","ÆÚ","vir","ÆÛ","vj","ÆÜ","vjr","Æİ","vjs","ÆŞ","vjf","Æß","vja","Æà","vjq","Æá","vjt",
			"Æâ","vjT","Æã","vjd","Æä","vp","Æå","vpr","Ææ","vps","Æç","vpf","Æè","vpa","Æé","vpq","Æê","vpt","Æë","vpd",
			"Æì","vu","Æí","vus","Æî","vuf","Æï","vua","Æğ","vuq","Æñ","vuT","Æò","vud","Æó","vP","Æô","vPf","Æõ","vPq",
			"Æö","vPt","Æ÷","vh","Æø","vhr","Æù","vhs","Æú","vhf","Æû","vha","Æü","vhq","Æı","vht","Æş","vhd","Ç¡","vhk",
			"Ç¢","vhkd","Ç£","vhl","Ç¤","vhls","Ç¥","vy","Ç¦","vys","Ç§","vyf","Ç¨","vyq","Ç©","vyt","Çª","vn","Ç«","vnr",
			"Ç¬","vns","Ç­","vne","Ç®","vnf","Ç¯","vnfa","Ç°","vna","Ç±","vnq","Ç²","vnt","Ç³","vnd","Ç´","vnj","Çµ","vnjd",
			"Ç¶","vnl","Ç·","vnls","Ç¸","vnlf","Ç¹","vnla","Çº","vnlt","Ç»","vb","Ç¼","vbs","Ç½","vbf","Ç¾","vba","Ç¿","vbt",
			"ÇÀ","vbd","ÇÁ","vm","ÇÂ","vms","ÇÃ","vmf","ÇÄ","vma","ÇÅ","vmq","ÇÆ","vmt","ÇÇ","vl","ÇÈ","vlr","ÇÉ","vls",
			"ÇÊ","vlf","ÇË","vla","ÇÌ","vlq","ÇÍ","vlt","ÇÎ","vld","ÇÏ","gk","ÇĞ","gkr","ÇÑ","gks","ÇÒ","gkf","ÇÓ","gkfx",
			"ÇÔ","gka","ÇÕ","gkq","ÇÖ","gkt","Ç×","gkd","ÇØ","go","ÇÙ","gor","ÇÚ","gos","ÇÛ","gof","ÇÜ","goa","Çİ","goq",
			"ÇŞ","got","Çß","goT","Çà","god","Ád","gog","Çá","gi","Çâ","gid","Çã","gj","Çä","gjr","Çå","gjs","Çæ","gjf",
			"Çç","gjfa","Çè","gja","Çé","gjq","Çê","gjt","Çë","gjd","Çì","gp","Çí","gpr","Çî","gps","Çï","gpf","Çğ","gpa",
			"Çñ","gpq","Çò","gpt","Çó","gpd","Çô","gu","Çõ","gur","Çö","gus","Ç÷","guf","Çø","gua","Çù","guq","Çú","gut",
			"Çû","guT","Çü","gud","Çı","gP","Çş","gPs","È¡","gPf","È¢","gPq","È£","gh","È¤","ghr","È¥","ghs","È¦","ghf",
			"È§","ghfx","È¨","gha","È©","ghq","Èª","ght","È«","ghd","È¬","ghx","È­","ghk","È®","ghkr","È¯","ghks","È°","ghkf",
			"È±","ghkt","È²","ghkd","È³","gho","È´","ghor","Èµ","ghos","È¶","ghot","È·","ghod","È¸","ghl","È¹","ghlr","Èº","ghls",
			"È»","ghlf","È¼","ghlq","È½","ghlt","È¾","ghld","È¿","gy","ÈÀ","gys","ÈÁ","gyf","ÈÂ","gyq","ÈÃ","gyt","ÈÄ","gn",
			"ÈÅ","gnr","ÈÆ","gns","ÈÇ","gnf","ÈÈ","gnfx","ÈÉ","gna","ÈÊ","gnt","ÈË","gnd","ÈÌ","gnj","ÈÍ","gnjs","ÈÎ","gnjf",
			"ÈÏ","gnja","ÈĞ","gnjd","ÈÑ","gnp","ÈÒ","gnpr","ÈÓ","gnps","ÈÔ","gnpf","ÈÕ","gnpd","ÈÖ","gnl","È×","gnlr","ÈØ","gnls",
			"ÈÙ","gnlf","ÈÚ","gnla","ÈÛ","gnlq","ÈÜ","gnlt","Èİ","gnld","ÈŞ","gb","Èß","gbr","Èà","gbs","Èá","gbf","Èâ","gba",
			"Èã","gbt","Èä","gbd","Èå","gm","Èæ","gmr","Èç","gms","Èè","gmsg","Èé","gme","Èê","gmf","Èë","gmfr","Èì","gma",
			"Èí","gmq","Èî","gmt","Èï","gmd","Èğ","gmx","Èñ","gml","Èò","gmls","Èó","gmlf","Èô","gmla","Èõ","gmlq","Èö","gmld",
			"È÷","gl","Èø","glr","Èù","gls","Èú","glf","Èû","gla","Èü","glq","Èı","glt","Èş","gld"};

char jamo[34]="rRseEfaqQtTdwWczxvgkoiOjpuPhynbml";
char* han_jamo[33]={"¤¡","¤¢","¤¤","¤§","¤¨","¤©","¤±","¤²","¤³","¤µ","¤¶","¤·","¤¸","¤¹","¤º","¤»","¤¼","¤½","¤¾",
					"¤¿","¤À","¤Á","¤Â","¤Ã","¤Ä","¤Å","¤Æ","¤Ç","¤Ë","¤Ì","¤Ğ","¤Ñ","¤Ó"};

CHan::CHan()
{
	//°Ë»ö ¼Óµµ Çâ»óÀ» À§ÇÑ »¡¸®°¡±â
	int mp=0;
	char* check_text[19]={"°¡","±î","³ª","´Ù","µû","¶ó","¸¶","¹Ù","ºü","»ç","½Î","¾Æ","ÀÚ","Â¥","Â÷","Ä«","Å¸","ÆÄ","ÇÏ"};
	for(unsigned int i=0; i<HAN_MAX; i++)
	{
		if(strcmp(han1[i*2], check_text[mp])==0)
		{
			mark[mp]=i;
			++mp;
			if(mp>=19)break;
		}
	}
	mark[19]=HAN_MAX;
}

unsigned int CHan::FindMark(char eng)
{
	for(unsigned int j=0; j<19; ++j)
		if(eng==jamo[j])return j;

	return 0;
}

char* CHan::EngToHan(char* text, char* han_area)
{
	unsigned int pp=0;
	unsigned int begin[STR_MAX], end[STR_MAX];

	//ÀÔ·Â ¹Ş±â
	strcpy(han, "");

	//ÇÑ±Û¿¡ ´ëÄ¡ ¾È µÇ´Â ´ë¹®ÀÚ¸¦ ¼Ò¹®ÀÚ·Î ¹Ù²Ş
	for(unsigned int i=0; i<strlen(text); i++)
	{
		if(han_area[i]==0)continue;
		if(text[i]>='A' && text[i]<='Z' && text[i]!='Q' && text[i]!='W' && text[i]!='E'	&& text[i]!='R'
			&& text[i]!='T' && text[i]!='O' && text[i]!='P')text[i]+=0x20;
	}

	//¸ğÀ½, ÀÚÀ½ ÇÑ±Û ¾Æ´Ô ¿©ºÎ È®ÀÎ(ÀÚÀ½ ÀÎ ºÎºĞÀ» Æ÷ÀÎÆ®·Î µÎ¾î¼­ º¯È¯¿¡ µµ¿òÀÌ µÇ°Ô ÇÔ)
	for(unsigned int i=1; i<strlen(text); i++)
	{
		//ÀÚÀ½ÀÎÁö ¸ğÀ½ÀÎÁö ±¸ºĞ
		for(int j=0; j<33; ++j)
			if(text[i]==jamo[j])
			{
				if(j>=MOUM)
				{
					begin[pp]=i-1;
					if(pp>0)end[pp-1]=i-2;
					++pp;
					i++;	//ÀÌÁß ¸ğÀ½ÀÇ °æ¿ì¸¦ »ı°¢ÇØ¼­ ´ÙÀ½À» ³Ñ±è(ÀÌÁß ¸ğÀ½À» ²÷¾î ÀĞ¾î ±ÛÀÚ°¡ µÇ´Â °æ¿ì´Â ¾øÀ¸¹Ç·Î ¿¹: µŞ»ê(O) µÎ¤Ó¤µ»ê(X))
				}
				break;
			}
	}
	if(pp>0)end[pp-1]=(unsigned int)strlen(text)-1;

	//Æ÷ÀÎÆ® Á¶Á¤(ÇÑ±ÛÀÎ ºÎºĞ¸¸ ÇØ¼®)
	for(unsigned int i=0; i<pp; i++)
	{
		char buffer[10];
		int bp=0;
		BOOL head = TRUE;	//¾Õ ºÎºĞÀÎÁö ±ÛÀÚ µŞºÎºĞÀÎÁö ¾Ë¾Æ³¿(Àß¶ó³»¾ß ÇÏ´Â ºÎºĞ ¿¹: 1@°¡2$ -> 1@Àº head=TRUEÀÎ »óÅÂ, 2$´Â head=FALSEÀÎ »óÅÂ¿¡¼­ ÀĞÀ½
		for(unsigned int j=begin[i]; j<=end[i]; ++j)
		{
			if(han_area[j] && (text[j]>='a' && text[j]<='z' || text[j]>='A' && text[j]<='Z'))
			{
				buffer[bp]=text[j];
				++bp;
				head=FALSE;
			}
			else
			{
				if(head)++begin[i];
					else end[i]=j-1;
			}
		}
		buffer[bp]=NULL;

		//¿µ¹®À» ÇÑ±Û·Î ÃÆÀ» ¶§ ÀÏÄ¡ÇÏ´Â ±ÛÀÚ Ã£±â
		while(strlen(buffer)>1)
		{
			BOOL find=FALSE;
			unsigned int loop_start=FindMark(buffer[0]);
			unsigned int loop_end=mark[loop_start+1];
			loop_start=mark[loop_start];

			for(unsigned int j=loop_start; j<loop_end; ++j)
				if(strcmp(han1[j*2+1], buffer)==0)
				{
					find=TRUE;
					break;
				}

			//Ã£Áö ¸ø ÇßÀ» ¶§ ¿µ¿ªÀ» ÁÙ¿©¼­ Ã£¾Æº½
			if(!find)
			{
				buffer[strlen(buffer)-1]=NULL;
				--end[i];
			}
			else break;
		}

		//ÀĞÁö ¸øÇÏ´Â ÇÑ±ÛÀÓÀ» Ç¥½Ã
		if(strlen(buffer)<=1)begin[i]=9999;
	}

	//º¯È¯
	unsigned int pp2=0;
	for(unsigned int i=0; i<strlen(text); i++)
	{
		while(begin[pp2]==9999)++pp2;

		//ÇÑ±ÛÀÎ ºÎºĞ
		if(pp2<pp && i==begin[pp2])
		{
			char buffer[10];
			int bp=0;
			for(unsigned int j=begin[pp2]; j<=end[pp2]; ++j)
			{
				buffer[bp]=text[j];
				++bp;
			}
			buffer[bp]=NULL;

			unsigned int loop_start=FindMark(buffer[0]);
			unsigned int loop_end=mark[loop_start+1];
			loop_start=mark[loop_start];
			for(unsigned int j=loop_start; j<loop_end; ++j)
				if(strcmp(han1[j*2+1], buffer)==0)
				{
					strcat(han, han1[j*2]);
					break;
				}

			i=end[pp2];
			++pp2;
		}
		//¾Æ´Ñ ºÎºĞ
		else
		{			
			//ÇÑ±Û ÀÏ¶§´Â ²÷¾îÁø ¸ğÀ½ ÀÚÀ½À¸·Î Ç¥Çö
			if(han_area[i]!=0 && (text[i]>='a' && text[i]<='z' || text[i]>='A' && text[i]<='Z'))
			{
				for(int j=0; j<33; ++j)
				{
					if(text[i]==jamo[j])
					{
						strcat(han, han_jamo[j]);
						break;
					}
				}
			}
			//°á±¹ ¾øÀ» ¶© ¹®ÀÚ ±×´ë·Î
			else
			{
				char tmp[2];
				tmp[0]=text[i];
				tmp[1]=NULL;
				strcat(han, tmp);
			}			
		}
	}

	han[strlen(han)]=NULL;
	return han;
}