char* snr[]={
	"00000그 사건은 의문의 저택의\n의문의 파티에서 일어났다.",
	"01000도대체 누가 우릴 초대한거지?",
	"02000글쎄?",
	"03000난 경로당 잔치인줄 알고 왔는디.",
	"04000......",
	"05000파티니까 오기 왔는데,\n모인 사람들이 수준이하야.",
	"06000물이 더러워.",
	"01000뭐가 어째?\n은하계 갑부 일도록님을\n모독하다니!",
	"00000응? 스피커에서\n무슨 소리가 나오는데?",
	"07000안녕하십니까?\n이 파티를 주최한 M입니다.",
	"00000M? 마기타인가?\n언제나 사건 뒤엔 마기타니까.",
	"07000지금부터 재밌고 스릴있는\n살인 게임이 시작됩니다.\n게임의 이름은......\n마 니 또",
	"01000에엑, 그게 무슨 살인 게임이야?\n장난하는 거냐?",
	"07000장난 아닙니다.\n이제부터 여러분 초대장 뒤를\n뜯어 보십시오.",
	"03000이게 뭐시당가?\n이름이잖어?\n이름이 어쨌다고?",
	"07000그 이름을 말하면 안 됩니다.\n거기 적힌 이름은 이 파티에\n초대된 사람중 한 명입니다.\n당신들은 그 사람을 지켜야 합니다.\n그리고 나머지를 죽이십쇼.",
	"05000마지막에 나와 이 사람이 살아남으면 승리라는 거군.",
	"07000그렇습니다.",
	"06000우리들이 이 게임을 하지 않으면 안 되는 이유가 뭐지?",
	"07000이유는 우승상품이 <똥똥 경제학놀이세트>이기 때문이죠.",
	"00000끄아아악! 갖고 싶다!\n어디 있는데? 그게?",
	"07000그리고 제한 시간은 정오까지 입니다.",
	"00000야! 내 말 씹냐?",
	"07000자정까지 2명이 안 남으면\n아잉~ 몰라 어떡해!\n그럼 시작!",
	"00999우선 누군지나 확인해 볼까?",
	"00999<이동헌>\n켁, 나잖아. 결국 난 혼자인가?\n어쩌면 편할지도 모르겠군.",
	"00999<일드록>\n저 짜증나는 부자녀석이군.",
	"00999<김미노>\n풋내기 탐정녀석인가?",
	"00999<미라>\n허걱! 저런 이집트에 돌아갈 국립박물관 저주의 물건이!",
	"00999<므족소녀>\n말없는 저 녀석이군.",
	"00999<이소미>\n저 아줌마말이군.",
	"00999<유수염>\n헉, 저런 이상한 놈이...",
	"게임을 즐겨 볼까?\nM녀석을 찾아내자.\n귀찮아. 다 죽이자.",
	"01000짜증나! 난 가겠어.\n모처럼 위대하신 몸이 왔는데 별 해괴망측한...\n응? 잠겼잖아!\n이런 젠장! 갇혀버린 건가...",
	"03000아이구메... 이를 워째.",
	"02000걱정할 필요없습니다!\nM은 한명, 우리는 6명.\n녀석의 게임에 따라줄 필요없이 녀석을 찾아봅시다.\n녀석은 분명히 이 집 어딘가에 있습니다.",
	"06000그건 그렇군.",
	"02000그럼 일드록씨는 3층을, 미라씨와 저와 므족소녀는 2층을, 저와 유수염군과 이동헌씨는 1층을 조사해보도록 하죠.",
	"00000이봐, 나한테 명령하지마!\n풋내기 탐정 주제에... 난 내가 알아서 조사할테니 냅둬!",
	"02000알았습니다. 알아서 하시죠.",
	"00999그럼 일단 수사진행방향을 설정해볼까?\n후후후...\n크앗! 이것이 수사수첩!\n고등학교 앞에서 나눠주는 것을 학생인 척하고 받아냈지!\nSPACE를 누른다면 볼 수 있다.\n사건 진행과 여러가지를 체크할 수 있지!",
	"00999아무 소리도 안 들린다.",
	"07999우걱 우걱 쩝쩝쩝",
	"07999케헥, 커헉, 웁웁웁,\n으아... 살았다!",
	"07999흑흑... 따뜻한 밥이 먹고 싶다.",
	"07999후훗, 역시 난 예뻐.",
	"07999이거 영 아니잖아.\n하긴 이런 후진 곳이니까...",
	"07999언니가 그렇게만 안 되었어도,\n이런 일은 안 할텐데 말이야.",
	"07999드르릉 퓨파~",
	"07999쿨쿨 크흥 커헉 켁켁!\n음냐 음냐.",
	"07999그래, 인공아... 이 할미가 그 못된 놈을 혼내줄껴.",
	"07999부스럭 부스럭",
	"07999흠... 이건 이쪽으로...",
	"07999이게 들키면 곤란하겠지.",
	"07999스미스, 그 녀석이다. 잊지 않았겠지.",
	"07999흠, 이 저택도 괜찮군. 사들일까?",
	"07999여기서 보니 서민들이 사는 하찮은 집들이 잘 보이는군.",
	"01999뭐야? 서민이라서 정치에 불만이 있는건가?\n왜? 내가 힘 좀 써서 바꿔주랴?\n하하하...",
	"01999뭐, 그게 뭔데?\n아아... 워낙 나랑 관계없다 보니 그만.",
	"01999사회가 정말 엉망이야.\n아무튼 우민들이 문제라니까...",
	"01999서민 주제에 문화를 입에 담지마!\n아무튼 잡놈들 때문에 문화수준이 떨어진다니까.",
	"01999그래, 가장 중요한 거야!\n한국인은 외국인을 죽이지 못하게 해야돼!\n뭐! 이게 외교랑 상관없다고!\n흥, 아무튼 외국인을 죽이는 놈들은 악마야!",
	"01999뉴스라면 예전에 마완도 사건이 충격적이었지?\n아, 뉴스에 보도 안 되어었나?\n난 내 정보망으로 얻고 있으니...",
	"01999화제거리라면 내가 입고 있는 이 옷이지?\n멋지지 않은가?",
	"01999유행이라면 내가 입고 있는 이 옷이지?\n멋지지 않은가?",
	"01999미군만세!",
	"01999난 골프를 좋아한다네.",
	"01999건강이 아주 중요하지.\n나 같이 모든 것을 다 가진 사람이 보다 더 즐기기 위해선 말이야.",
	"01999의학에는 내가 많이 투자하지.\n왜냐면 난 오래 살아야 되거든!",
	"01999내 알바가 아냐!",
	"01999흠, 골빈 부자들은 별거 아닌 골동품을 모은다고 돈을 써대지.\n하지만 난 무기수집이 취미라네.",
	"01999내 취미는 높은데서 서민들을 내려다 보는거지.",
	"01999특기라면 돈뿌리기지.\n던지는 기술에 따라 서민들의 움직임이 틀려지지.",
	"01999우민들에겐 교육이 필요없어.\n결국엔 우민화일뿐이지.\n엘리트들만 양성해야 해.",
	"01999내가 곧 정의!",
	"01999나의 철학은 내가 곧 정의!",
	"01999난 무교야.\n난 신에게 의존하는 멍청한 짓은 하지 않아.\n그런데도 이렇게 돈이 많지 않은가?",
	"01999난 미혼이네.\n전부 다 나의 돈을 노릴 뿐이지.\n그래서 난 아무도 믿지 않아.",
	"01999사랑은 종족번식을 위한 호르몬의 작용일 뿐이지.",
	"01999돈!",
	"01999보다 인생을 즐기는 것.",
	"01999가족은 없어.\n그리고 필요도 없어.",
	"01999이렇게 젊어보여도 난 48세이지.",
	"01999그건 알아서 뭐 할건가?",
	"01999그건 알아서 뭐 할건가?",
	"01999A형이다.",
	"01999천칭자리인데 불만인가?",
	"01999말하지 않았나?\n사랑은 종족번식을 위한 호르몬의 작용일 뿐이지.",
	"01999흥, 서민이 할 질문 답군.\n자네 따위는 상상도 못 하지.\n우선 정문에서 집앞까지 기차를 타고 내려서 버스를 타고 근처에서 택시를 타고 간다네.\n식사는 더 엄청나지만 귀찮으니 알아서 상상해보시지.",
	"01999돈이 최고이지.",
	"01999친구가 있었지.\n아주 마음에 맏는 친구였어.\n어느 날 그는 위험한 임무를 띠고 한 섬으로 가게 되었어.\n그리고 돌아오지 않았어.\n그리 오래되지도 않은 이야기야...\n너는 이 이야기가 슬프지 않겠지?",
	"01999난 선생따윈 안 믿어.",
	"01999하하하... 으하하하하\n어이가 없군.",
	"01999옛 친구를 죽인 녀석이지.\n하지만 복수할 때도 머지 않았어.",
	"01999난 최고다. 난... 최고다.\n난 항상 옳다.",
	"01999넌...",
	"16999아유, 글쎄 김씨와 박씨가 그렇다지 뭐유.\n깔깔깔\n아, 그리고 이씨가 그 곳에서 밥을 먹었다네요.\n호호호!",
	"01999누굴? 왜?",
	"01999자넨 게임에서 죽으라면 진짜 죽나?",
	"01999???\n이 서민이 미쳤나?",
	"01999별로 안 좋아하네.",
	"01999글쎄, 지금보면 M이 들어가는 이름을 가진 사람은 김미노, 므족소녀, 이소미, 미라 4명이지.\n하지만 의외로 나머지 3명일수도 있지.\n결국 누군지 알 수 없지.",
	"01999그래 오늘이야.\n오늘에야 말로 녀석을...",
	"01999뭘? 돈?\n좀 줄까?",
	"16999아아... 배고프다.\n그런데 이게 유도심문과 관련있나...",
	"16999금발이다.\n외국인이란 소리지.",
	"16999눈은 검은색이다.\n머리는 금발인데 말야.",
	"16999별 특징없는 코다.",
	"16999이가 반듯하다.\n돈이 많으니 교정하고, 표백했나 보군.\n응? 표백...? 표백이란 단어가 아닌 것 같은데.\n뭐, 내가 치과의도 아니고 알 바 아니지.",
	"169992개다.",
	"16999어퍼컷 한 방 먹이고 싶다.",
	"16999목이 없다.",
	"16999저 이상 옷 때문에 어깨가 넓어보인다.\n아니면 정말 덩치가 큰 건가?",
	"16999넓다.",
	"16999아마 똥배가 나왔을 것이다.",
	"16999등도 넓겠지.\n이 녀석 상당히 덩치일지도...",
	"16999옷 안에 숨기고 있다.\n저 덩치면 팔도 굵겠지.",
	"16999옷 안에 숨기고 있다.\n혹시 무기를 들었을지도...",
	"16999다리는 옷에 가려지지 않았다.\n뭐 특징은 없다.",
	"16999보이지 않는다.",
	"16999콧 평수가 넓다.\n코딱지는 보이지 않는다.\n관리를 잘 하나보다.",
	"16999귀지가 보이지 않는다.\n내가 억지로 보려고 하니 상당히 불쾌하게 느끼는 듯 하다.",
	"16999입 속에 나불대는 저 혀가 밉살스럽다.",
	"16999그런 것은 보고 싶지 않다.",
	"16999옷 때문에 보이지 않는다.",
	"16999구두 때문에 보이지 않는다.",
	"16999상당히 인공미가 느껴지는 수염이다.\n자연적으론 저런 모양이 나오긴 힘들다.\n뭐라도 바른 건가? 아니면...",
	"16999엄청 이상한 옷이다.\n돈이 남아 도니 이상한 것을 입는가 보다.\n하지만 아마 고급품일 것이다.",
	"16999옷은 이상 하지만, 특별한 악세서리는 눈에 띄지 않는다.",
	"16999난 투시가 불가능하다.",
	"16999생각만 해도 구역질난다.",
	"16999없다.\n요괴가 둔갑한 것 아닌 듯하다.",
	"16999없다.\n곤충이 아닌 듯 하다.",
	"16999없다.\n생선이 아닌 듯 하다.",
	"16999없다.\n있었다면 충격이었을 것이다.",
	"16999없다.\n뱀도 아닌 것이란 말인가!",
	"16999흠... 흠... 그렇군.\n전체적으로 재수없다.",
	"02999지도자는 공기와 같아야 하는 것.\n공기는 보이지 않지만 공기가 없으면 우리는 살 수 없지.\n사람들은 공기의 고마움을 잘 모르고 살아가지만 보이지 않아도 우리의 목숨을 이어주고 있지.",
	"02999돈이란 돌고 돌아야 되는 것.\n한 곳에 있다보면 썩게 되어있지.\n돈을 쌓거나 모은다고 착각하는 사람들이 많은데, 돈을 돌리고 돌려야 하는 거야.\n부자란 보다 많은 돈을 유통시키는 사람이겠지.",
	"02999우리 사회의 문제라면 무능한 탐정이 아닐까?\n바로 너처럼 말야. 하하하!",
	"02999문화? 어울리지 않는 소리를 하는군.",
	"02999미안하지만 난 탐정이라서.\n본업에 충실하고 싶어.\n외교는 정부에서 알아서 하라지.",
	"02999얼마 전에 대사건이 있었지.\n그리고 그걸 해결한 게 나야.\n어때? 대단하지 않아?",
	"02999바로 명탐정 김미노의 소문이겠지.",
	"02999유행이라면 내 마스코트가 유행 아닐까?",
	"02999군대는 모병제가 되어야 해.",
	"02999난 만능 스포츠맨이야.",
	"02999늙었냐? 건강 걱정하게?",
	"02999검시술이 발달하면 좋겠군.",
	"02999현대 사회에서 가장 중요한 역활을 하고 있는 것이지.\n하지만 예전엔 미래가 기계문명이 발달할 걸로 예측했어.\n전기 자동차나 수직이착륙 비행기, 시속 600Km이상의 기차.\n하지만 세상은 정보화로 발달 되었어.\n그러니까 지금 예측하고 있는 정보화 미래와 달리 미래는 다시 방향이 바뀌어서 다른 것이 발달할 지도 모르지.",
	"02999쇼핑... 사치스런 소리군.",
	"02999취미라...\n그런 것은 잊은 지 오래야.\n탐정이 된 이후로 사건의 연속이었으니까...",
	"02999탐정의 특기가 사건해결 밖에 더 있겠냐?",
	"02999탐정학교를 만들어야 돼.\n김미노 명탐정 학교.",
	"02999정의... 약간 틀리긴 하지만 내가 믿는 것은 진실 뿐!",
	"02999맡은 사건은 깔끔하게 처리하는 거지.",
	"02999난 왕언니교야.\n훗, 믿냐?",
	"02999아직 젊으니까 미혼이지.\n하지만 계획이 없는 것은 아냐.\n단지 내 수준에 맞는 상대가 없는 것이 문제지.",
	"02999사랑이 최고!",
	"02999지혜로운 여자가 최고지.\n하지만 이상형은 존재하지 않기 때문에 이상형이라고 하는게 아닐까?",
	"02999세계정복이야. 아하하핫!",
	"02999내가 왜 너에게 가족 얘기를 해야 하지?\n우리 가족이라도 되게?",
	"02999흠, 몰랐냐?\n26살이다.",
	"02999176Cm",
	"0299968Kg",
	"02999B형이야.",
	"02999사수자리야.",
	"02999애인은 아직 없어.\n내가 수준이 너무 높거든.",
	"02999탐정이랍시고 남의 사생활을 조사하는거야?\n후후, 하긴 너같은 탐정이 먹고 살려면 그런 거라도 해야지.\n난 하지만 사건의뢰만 받아.",
	"02999진실만 믿는다.",
	"02999너 기억나냐?\n예전에 네 녀석이 증거품인 독캔디를 먹어버린 사건.\n그것 때문에 내 사건 해결에 오점을 남겼어.\n아무튼 왜 독캔디 먹고 지랄떨다 실려갔냐?\n난 너같은 바보 처음 봤었다.",
	"02999흠, 기억 안 나는걸.\n내 스승은 나야.\n굳이 말하자면 과거에 존재했던 현인들일까?",
	"02999그건 아주 오래된 이야기기이지.\n과거에 난 한 소녀를 사랑했었다.\n그 소녀도 날 사랑한다고 했어.\n우린 행복했었지.\n그런데 깨어보니 꿈이더라.",
	"02999너야, 이 자식아!\n 독캔디 사건만 생각하면 정말이지... 어휴!",
	"02999난 잘났지.",
	"02999넌 못났지.",
	"16999아유, 글쎄 김씨와 박씨가 그렇다지 뭐유.\n깔깔깔\n아, 그리고 이씨가 그 곳에서 밥을 먹었다네요.\n호호호!",
	"02999탐정한테 무슨 허튼 수작이야?\n삼류라서 날 질투해서 날 범인으로 모는 것 아닌가?\n난 명탐정이지 살인탐정이 아니라고.",
	"02999흠, 그래야 겠지.\n그럼 내가 널 바로 현장에서 체포해 주지.",
	"02999그래 내가 M이 맞아.\n하지만 범인은 아니지.\n범인이 가장 거짓말 할 가능성이 높은데, 이상하게 사람들은 범인 말을 가장 잘 믿는 것 같아.\n웃기지도 않지.",
	"02999으하하하.\n역시 바보!\n그 유도와 이 유도가 같냐?",
	"02999그거야 아직은 알 수 없지.\n하지만 곧 모습을 드러낼 거야.",
	"02999그래, 오늘은 나의 실적을 하나 더 쌓는 날이지.",
	"02999흥, 중요한 증거를 너한테 보여주겠냐?\n이 사건은 내가 해결한다.\n독캔디 사건 때처럼 날 방해하지 말라구!",
	"16999아아... 배고프다.\n그런데 이게 유도심문과 관련있나...",
	"16999하늘색 머리.\n추리물이라면 현실적으로 그려야 하는데 만화풍으로 그려놨다.\n사실은 한국인이니 흑발이겠지.\n염색한 것일수도 있고.",
	"16999눈을 감고 있다.\n저러고도 보이나?\n이런 녀석들은 대개 자신의 진심을 안 들키기 위해서 눈을 숨기는 것이지.\n이 놈... 본능적으로 위험한 놈이란 생각이 든다.",
	"16999삼각형 코. 이녀석 진짜 만화인물처럼 생겼다.",
	"16999말할때도 크게 입을 벌리지 않는다.\n혹시 입 안에 뭔가 숨겼나?\n다이아몬드 이같은 게 있으면 한 방 매겨서 빼내야지.",
	"16999없다!\n이녀석 정말 만화캐릭터인가!\n그러고 보니 나도 없다.\n어떻게 된 것이지?",
	"16999별 특징 없다.",
	"16999별 특징 없다.\n단순하게 그려놨다.\n이런 류 그림체에선 특징없는 부분은 생략하기 일쑤다.",
	"16999별 특징 없다.",
	"16999주머니에 뭔가 넣어 두었다.\n수첩인가? 탐정수첩?\n난 고등학교 앞에서 나눠주는 노트를 쓰는데...\n이 놈, 감히 건방지게...\n척살대상 1호다!",
	"16999똥배가 없다.\n약간은 부럽다.\n하지만 난 사람을 먹다보니 어쩔 수 없이 나오게 된 것이다.",
	"16999별 특징없다.",
	"16999별 특징없다.",
	"16999완전히 펴고 힘을 빼고 있다.",
	"16999다리가 길다...",
	"16999발바닥이 넓다.",
	"16999좁다. 숨쉬기 힘들테니 넓혀줄까?",
	"16999귀도 없는데 뭐...",
	"16999침이 튄다.",
	"16999한 번은 가랑이가 찢어진 바지를 입은 사람을 봤다.\n응? 그런 나였나?",
	"16999아주 깔끔하다.\n놈의 성격을 알듯도 하다.",
	"16999의외로 안 보이는데는 기르고 있을지 모른다.\n겉고 속이 틀린 사람이라면!",
	"16999없다. 기르면 정말 이상하겠다.",
	"16999평범한 옷이다.\n그냥 편한 옷을 입은 것을 보아 이녀석은 작업의 효율을 따지는 것이겠지.\n하지만 최소한의 예는 갖추었다.\n이 몸은 예를 무시해서 가장 편한 런닝 차림 아닌가?\n하하하하!",
	"16999녀석 성격에 그런 것을 달았을리 없지.",
	"16999흠, 뭔가를 숨기고 있는 것은 아닌 듯 하다.",
	"16999내가 지금 무슨 생각을 하지?",
	"16999없다.\n요괴가 둔갑한 것 아닌 듯하다.",
	"16999없다.\n하지만 저 머리카락... 혹시 위장?",
	"16999없다.\n생선이 아닌 듯 하다.",
	"16999없다.\n저런 간편한 차림이라면 숨기기도 불가능하다.",
	"16999없다.\n뱀도 아닌 것이란 말인가!",
	"16999이 녀석은 사람들 앞에선 나에게 경어를 쓰다가 단 둘이 있을때는 반말을 하며 바보취급을 한다.\n죽여주지, 가까운 시일내에...",
	"03999난 늙은이라서 그런 것 잘 몰러.\n관심도 없고.",
	"03999난 늙은이라서 그런 것 잘 몰러.\n관심도 없고.",
	"03999난 늙은이라서 그런 것 잘 몰러.\n관심도 없고.",
	"03999난 늙은이라서 몰러.",
	"03999난 늙은이라서 모른 당께!\n관심도 없다구.",
	"03999탐정학교에서 실종 사건이 있었다고 하던디.\n학생과 선생들이 교장실에 감금되어 있었다고 하더구먼.\n그런데 이미 발견되었을 때는 모두 굶었 죽었다고 하더구만.\n끔찍한 일이여.",
	"03999탐정학교 사건 진범을 잡히느냐? 마느냐?\n그것이 화제구만.\n한 학생이 용의자를 아는데 입을 다물고 있다는구만.",
	"03999우리가 어릴 때는 전염병이 유행이였지.\n유행은 정말 무서운거여.\n나도 그때 전염병에 걸렸는데, 무사히 목숨은 건졌지.\n대신 얼굴이 이 모먕이 되었구만.",
	"03999젊은이들이 나라를 지켜주기에 우리가 편히 살 수 있는거여.",
	"03999에구구... 허리야...",
	"03999에구구... 늙어서....\n이젠 살 날도 얼마 남지 않은거 같어.",
	"03999사람의 수명은 다 정해져 있는겨.\n나도 욕심을 내지 않지.",
	"03999노인대학에라도 가서 배워 볼까?",
	"03999장보러 가기도 이젠 힘들어.",
	"03999내 취미라면 그냥 자연이나 감상하는 거여.\n아니면 손녀랑 노는 거였지.\n이젠 손녀는 없지만...",
	"03999이 할미가 늙었어도 요리를 좀 하지.\n손녀도 내 요리를 매우 좋아했어.",
	"03999어떤 것을 가르쳐도 좋으니, 아이들에게 사고가 나지 않게 안전한 학교를 만들어야 되는겨.",
	"03999......",
	"03999그런 어려운 것은 모르게구만.",
	"03999난 성당에 다니는구만.",
	"03999늙은이에게 무엇을 묻는거여?\n손녀가 있었다니까.",
	"03999남녀간의 사랑은 한순일뿐이여.\n진짜 중요한 것은 가족이겠지.",
	"03999늙은이이게 뭘 묻는겨?",
	"03999내 꿈은 그냥 죽을 때까지 손녀 커가는 것을 봐가는 거였어.\n하지만 그 작은 꿈도 하나님이 이뤄주시지 않으셨지.\n모든 것을 감사하라고 하지만, 솔직한 심정으로 원망스럽구만.",
	"03999아들 녀석이 있었고, 결혼을 해서 딸을 낳았지.\n나와 아들, 그리고 며느리, 손녀.\n그런 행복한 가정이구만.",
	"0399971살이구만.",
	"03999글쎄... 기억이 안 나는디...",
	"03999글쎄... 기억이 안 나는디...",
	"03999글쎄... 기억이 안 나는디...",
	"03999그건 기억하지.\n처녀자리구만.",
	"03999늙은이이게 뭘 묻는겨?",
	"03999그냥 경로당에서 노인들하고 시간이나 보내고 있지.",
	"03999가족이 최고.",
	"03999손녀와의 추억만 남는구만.",
	"03999너무 오래된 이야기야.\n학창시절이란 것은...",
	"03999기억이 안 나는구만.",
	"03999손녀를 죽인 녀석이지.\n하지만 이 늙은이에겐 아무 힘이 없어...",
	"03999난 늙었지.",
	"03999넌 젊지.",
	"16999아유, 글쎄 김씨와 박씨가 그렇다지 뭐유.\n깔깔깔\n아, 그리고 이씨가 그 곳에서 밥을 먹었다네요.\n호호호!",
	"03999응? 뭐라고? 안 들려.",
	"03999응? 뭐라고? 좀 크게 말해봐.",
	"03999이 놈아, 노인에게 경어를 써야지.\n그리고 내 성은 왕이여.\n아들 성은 여씨였고.",
	"03999아이구... 허리야...",
	"03999글씨... 모르겠구만.",
	"03999??????",
	"03999들켰나? 너도 먹을겨?\n고구마.",
	"16999아아... 배고프다.\n그런데 이게 유도심문과 관련있나...",
	"16999분홍색 머리.\n그럼 젊을땐 빨간 머리였나?\n그것보다 피부색이 더 미스테리다.",
	"16999눈이 크다.\n미소녀 할머니다.\n그런데 눈썹은 없다.",
	"16999납작하게 가라 앉았다.\n혹시 이 할머니 닌자?",
	"16999쭈글쭈글 주름이 많다.",
	"16999머리카락에 덮혀 있다.",
	"16999별 특징 없다.",
	"16999가늘다.\n한방에 부서버릴 수도...",
	"16999별 특징 없다.",
	"16999으엑... 보기 괴롭다.",
	"16999분명 말라 붙었을 것이다.",
	"16999분명 말라 붙었을 것이다.",
	"16999가늘다.",
	"16999손가락도 말라 붙어 있다.\n이 할머니, 과연 몸에 2/3이 물일까?",
	"16999가늘어서 길어 보인다.",
	"16999몸무게는 별로 안 되어 보이지만 몸을 지탱할 수 있을까 의문이 들 정도로 작은 발이다.\n명나라에 여자들에게 하던 머시기 족을 당했나?",
	"16999거미줄이 있을까 두렵다.",
	"16999보이지 않는다.",
	"16999바짝 말라있다.\n살아있나? 이 할머니...",
	"16999으엑...",
	"16999길다. 이 할머니 관에서 나왔나?",
	"16999보이지 않지만 길테지.",
	"16999있으면 악몽이다.",
	"16999늙은 사람치고 화려한 옷이다.\n전체적으로 가장 눈에 띄는 점이다.",
	"16999없다.",
	"16999몸 속도 말라 비틀어져 있겠지.",
	"16999허걱! 이상한 자가 내 의식을 이상한 곳으로 모는 듯 하다.",
	"16999없다.\n인간의 시체이듯 싶다.",
	"16999없다.\n없다. 곤충으 아닌 듯 하다.\n바짝 마른 것이 곤충같기도 하지만.",
	"16999없다.\n생선이 아닌 듯 하다.",
	"16999없다.\n이미 죽어서 올라가도 이상할 것이 없다.",
	"16999없다.\n무서운 것을 생각해 버렸다.",
	"16999박물관에 팔면 얼마나 받을 수 있을까?",
	"04999국가 권력을 획득하고 유지하며 행사하기 위하여 벌이는 여러 가지 활동",
	"04999인간이 공동생활을 하는 데에 필요한 재화(財貨)를 획득·이용하는 활동을 함, 또는 이를 통하여 이루어지는 사회관계",
	"04999공동생활을 하는 인간의 집단",
	"04999인지(人智)가 깨어 세상이 열리고 생활이 보다 편리하게 되는 일",
	"04999외국과의 교제나 교섭, 또는 국가 상호 관계를 맺는 일",
	"04999여기까지 제작되고 있을 당시 이라크 한국인 피랍사건이 뉴스였음",
	"04999안티프라민을 5개같이 사면 2카오 깎아드림",
	"04999므족은 영원히 변하지 않는 것이 원칙이라서 유행과 무관",
	"04999므는 평화를 사랑하는 종족",
	"04999므족의 전통 경기는 므루므루",
	"04999건강함",
	"04999인체의 구조와 기능, 건강과 질병의 여러 현상을 연구하며, 건강 유지와 질병의 예방 및 치료에 관한 기술을 발전시켜 나가는 학문",
	"04999전자 회로를 이용하여 고속˙자동으로 계산이나 자료를 처리하는 기계. 수치 계산, 자동 제어, 사무 관리, 데이터 처리, 언어˙화상(畵像)의 정보 처리 등 광범위하게 이용됨. 전자계산기",
	"04999므족은 므족의 마을에서 자체공급",
	"04999벽지의 ㅁ숫자 세기",
	"04999도구판매",
	"04999므 장로님께서 가르쳐 주심",
	"04999므 지도자님을 따름",
	"04999사람을 지혜롭게 하는 학문",
	"04999므족은 위대한 의지를 따름",
	"04999므족은 므족끼리만 결혼함",
	"04999므족은 사랑을 모름",
	"04999므족은 사랑을 모름",
	"04999오직 위대한 의지를 따름",
	"04999아버지, 어머니, 누이가 있음",
	"0499914살",
	"04999155Cm",
	"0499945Kg",
	"04999ㅁ형",
	"04999ㅁ자리",
	"04999없음",
	"04999없음. 모든 것이 위대한 의지의 뜻",
	"04999위대한 의지의 뜻",
	"04999므족 지도자님 중 한 분이 축구 비슷한 경기의 선수였음",
	"04999므 장로님",
	"04999없음",
	"04999없음",
	"04999위대한 의지에 따라 이곳에 사명을 띠고 존재하는 존재",
	"04999당신 역시 위대한 의지에 따라 이곳에 사명을 띠고 존재하는 존재",
	"16999아유, 글쎄 김씨와 박씨가 그렇다지 뭐유.\n깔깔깔\n아, 그리고 이씨가 그 곳에서 밥을 먹었다네요.\n호호호!",
	"04999아무 안 죽임",
	"04999그렇게 생각 안 함",
	"04999한글을 사랑해야 됨",
	"04999관심 없음",
	"04999알 수 없음",
	"04999내일도 좋음",
	"04999오늘은 희귀물품이 없음",
	"16999아아... 배고프다.\n그런데 이게 유도심문과 관련있나...",
	"16999갈색 학생머리임.\n앗, 말투가 옮았다.",
	"16999작다. 단추구멍이다.",
	"16999없다.",
	"16999일자이다.\n아무 감정도 느껴지지 않는다.",
	"16999없다. 얼굴이 구체에 한없이 가깝다.",
	"16999둥글다.",
	"16999없다. 예전에 달걀과 요구르트병으로 만든 인형이 생각난다.",
	"16999별 특징 없다.",
	"16999아직 어린애군.",
	"16999별 특징 없다.",
	"16999별 특징 없다.",
	"16999진짜 별 특징 없다.",
	"16999진짜 별 특징 없다.",
	"16999너무 일반적으로 생겼다.\n므족들이란 도대체?",
	"16999너무 일반적으로 생겼다.\n므족들이란 도대체?",
	"16999코가 없다.",
	"16999보이지 않는다.",
	"16999입을 여는 것을 못 봤다.\n말 할때도 복화술을 쓰는 듯 하다.",
	"16999이 항목은 왜 만들어 놨을까?",
	"16999적당하다.",
	"16999보나마나 적당하다.\n얼굴 부분빼고는 몸은 완전 표준이다.",
	"16999얘는 여자애잖아.\n난 사람 상대함에 있어 남녀노소를 가리지 않고 처치해 주지만,\n수염은 남녀노소를 가린다.\n신기한 일이야. 하하...",
	"16999ㅁ족의 의상인듯 싶다.\n듣기론 므족마을은 집들이 모두 ㅁ모양이라고 한다.",
	"16999저 리본...\n그냥 평범한 빨간 리본.",
	"16999해부해보고 싶다.\n신기한 종족.\n하지만 난 해부는 취미가 아니라서.\n시식은 좋아해도 말이다.",
	"16999허걱! 이상한 자가 내 의식을 이상한 곳으로 모는 듯 하다.",
	"16999없다.\n므족은 꼬리가 없음",
	"16999없다.\n므족은 더듬이가 없음",
	"16999없다.\n므족은 아가미가 없음",
	"16999없다.\n므족은 날개이가 없음",
	"16999없다.\n므족은 비늘이 없음",
	"16999므족은 신비의 종족이야!!!",
	"05999왜 남자들은 모이면 정치얘기같은 거나 하는거지?",
	"05999우리집은 예전에 잘 나갔는데 말이야.\n아무튼 요즘은 경제사정이 않 좋아.",
	"05999아무튼 망할 사회야.",
	"05999문화생활도 못 즐기고 있어.\n요즘은...",
	"05999내가 알게 뭐야?",
	"05999뉴스는 그 날 이후로는 안 봐.",
	"05999화재! 화재 얘기는 하지마!\n화제라도 마찬가지야!",
	"05999유행이라면 할 말 많지.\n하지만 당신이 못 알아들을걸?",
	"05999정말 남자들이란 할 얘기가 그렇게 없어?",
	"05999옛날에 육상을 좀 했어.",
	"05999아무 관계도 없는데, 왜 내 건강을 묻지?",
	"05999몰라. 그런 것.",
	"05999너무 발달해 버렸어.\n별로 쓸모는 없으면서.\n정신없이 발전해서 배우기도 귀찮고...\n아무튼 컴퓨터같은 것은 왜 있나 몰라.",
	"05999흠, 돈 좀 있다면 그걸 살텐데 말야.",
	"05999알아서 뭐하게?\n나에게 관심있어?",
	"05999암살.\n깔깔깔!",
	"05999난 여러가지를 배웠지.\n언니와 함께 우리집 선생에게...",
	"05999잘은 몰라도 받은 만큼 갚아주는게 정의겠지.",
	"05999아아, 그 단어는 듣기도 싫어.",
	"05999무교야.\n난 신을 믿을 만큼 한심하지 않거든.\n하지만 악마의 존재는 믿어.\n없애버려야 되는 존재지.",
	"05999아직 미혼이야.\n왜 관심있어?",
	"05999진짜 나한테 관심있어?",
	"05999당신과 정반대이면 되겠지.",
	"05999꿈이라면 과거에 그 시절로 돌아가고 싶지.\n하지만 불가능한 꿈이야.\n그래서 이제 할 수 있는 것은 원수를 갚는 것 정도일까?",
	"05999우리 집은 대단한 집이었어.\n부모님, 그리고 언니가 있었지.\n하지만 언니는 부모님의 저택과 함께 불타버렸어.",
	"05999비밀♡",
	"05999비밀♡",
	"05999비밀♡",
	"05999O형이야.",
	"05999쌍둥이 자리야.",
	"05999없지만 당신은 해당사항이 없어.",
	"05999알아서 뭐하게?\n스토커였어?",
	"05999귀찮아.\n그런 것을 왜 가지고 살아가는 거지?",
	"05999아아... 정말 그때는 좋았는데 말야.",
	"05999우리집 가정교사였던 늙은이는 절대 은사가 아냐.",
	"05999없었어.\n난 눈이 높아 수준 낮은 사람들에겐 사랑을 못 느끼거든.",
	"05999우리 저택을 불태웠던 녀석.",
	"05999난 예쁘고 지적인 여자.",
	"05999악마",
	"16999아유, 글쎄 김씨와 박씨가 그렇다지 뭐유.\n깔깔깔\n아, 그리고 이씨가 그 곳에서 밥을 먹었다네요.\n호호호!",
	"05999글쎄?",
	"05999난 명령 듣는 것은 싫어하거든.\n규칙에 얽매이기도 싫고.",
	"05999뭐야? 이 사람?",
	"05999아니.",
	"05999그야 나는 모르지.",
	"05999뭘?",
	"05999뭘?",
	"16999아아... 배고프다.\n그런데 이게 유도심문과 관련있나...",
	"16999금발로 염색한 머리.\n한껏 폼을 내고 있다.",
	"16999속 눈썹이 부담스럽다.",
	"16999콧대가 높다.\n꼭 외형적인 이야기만 아니라.",
	"16999다물고 있다.",
	"16999귀에는 귀걸이를 하고 있다.\n귀고리인가?",
	"16999약간 균형이 안 맞다.\n작가의 실수인가?",
	"16999약간 길다.\n아니 정상적일진 모르겠지만, 워낙 여기있는 사람들이 목이 짧아서일까?",
	"16999갸날프다.\n우후후... 싸운다면 쉽게 이길 수 있겠어.",
	"16999목걸이가 신경 쓰인다.\n한 번 본 것 같기도 하다.",
	"16999날씬하군.",
	"16999벽을 기대고 서있는 것이 습관인가 보다.",
	"16999가늘어서 별로 힘은 없어 보인다.",
	"16999반지를 끼고 있다.\n결혼 반지는 아니고, 양쪽 검지에 끼고 있다.\n왠지 견고해 보인다.",
	"16999약간 긴 편인가?\n달리기엔 좋겠다.",
	"16999구두를 신은 줄 알았는데, 의외로 운동화이다.\n왠지 어울리지 않다.",
	"16999깨끗하군.\n얼굴 관리를 신경쓰나 보군.",
	"16999깨끗하군.",
	"16999입 안에 뭐를 숨긴 것 같진 않다.",
	"16999내가 살인, 방화, 납치, 절도는 했어도 성범죄에 있어서는 깨끗하다.",
	"16999가짜손톱을 끼고 있다.\n왠지 견고해 보인다.",
	"16999운동화를 신은 것을 봐서 효율을 따지는 것이니,\n발톱은 짧게 잘랐을 것이다.",
	"16999있을 턱이 있나.",
	"16999별로 비싼 옷 같지는 않지만,\n왠지 기품이 있어 보이는 듯도 하다.",
	"16999귀걸이, 목걸이.\n그리고 양쪽 손가락에 반지.",
	"16999날씬해 보이는 것으로 봐서 안에 무언가를 숨기고 있는 것은 아닌 듯 하다.",
	"16999왜 이런 항목을 만들어 놨을까?",
	"16999없다.\n여우는 아닌 듯 하다.",
	"16999없다.\n곤충은 아닌 듯 하다.",
	"16999없다.\n인어는 아닌 듯 하다.",
	"16999없다.\n천사는 아닌 듯 하다.",
	"16999없다.\n꽃뱀은 아닌 듯 하다.",
	"16999자고로 여자를 조심하고 했지.\n영웅은 여자때문에 망하지.",
	"06999정치가들이 문제야.\n내가 국회로 가야 돼.",
	"06999음, 고등학생인 내가 할 말은 아니지만 내가 경제사정이 안 좋아서 말야.\n배도 고프다고.\n요는 라면이나 끓여먹었으면 하는 거지.",
	"06999사회가 혼란스러우니까 내가 대학가기가 힘든거야.",
	"06999역시 도심지로 갈 수록 문화가 10년은 앞서 있지.",
	"06999우리나라는 너무 비굴해.\n내가 왕이었다면 말야 세계를 정복했을 거야.",
	"06999뉴스는 꼭 챙겨보지.\n그 시간대는 제법 한가하거든.\n뭐 난 고등학생이라서 백수는 아냐.",
	"06999여러가지가 있지.\n특히 요즘은 내가 하고 있는 수염놀이가 화제야.",
	"06999유행이라면 낙지춤이 우리 반에서 유행이지.",
	"06999아아... 가기 싫다.\n빨리 통일이 돼야지.",
	"06999난 공부만 하는 타입이라서 별로.\n특히 이제 입시 준비해야지.",
	"06999아무튼 고3 생활은 체력이 중요해.",
	"06999뭐 빨간약이 만병통치약 아닐까?",
	"06999난 컴맹이라서.\n어차피 대학입시와 컴퓨터는 상관없잖아.",
	"06999폐점시간에 가서 싸게 떨이로 파는 것을 사먹는 것이 낙이지.\n그래도 난 자존심이 있어서 시식만 하진 않아.",
	"06999취미는 먹기.",
	"06999내 특기라면 공부지.\n한 공부하거든.\n열굴만 봐도 고시생 같지 않아?",
	"06999교육제도가 문제야.\n선생들은 무능하고, 교육부는 위에서 떵떵거리기만 하고 말야.\n아무튼 이 나라는 이 모양이라니까.",
	"06999정의는 이긴 자의 것이지.",
	"06999우린 철학시간에 발표만 하더라고.",
	"06999기독교인데, 사실 교회만 다니고 있을 뿐이지.\n뭐 하나님의 존재같은 것은 잘 모르겠다구.",
	"06999고등학생인데 벌써 결혼 했겠어?\n안 그래도 겉늙은 것이 컴플렉스니까 그런 소리 하지마.\n친구들도 그렇게 놀린단 말이야.",
	"0699941번 사랑해서 41번 차였지.",
	"06999돈 많은 여자.",
	"06999좋은 대학 가는 거.",
	"06999부모님 계시고, 동생이 2명이지.\n여동생 하나, 남동생 하나.",
	"0699919살",
	"06999181Cm",
	"0699980Kg",
	"06999AB형이야.",
	"06999물고기 자리야.",
	"06999어흑흑흑...",
	"06999신경쓰지마.\n왠 간섭이야!",
	"06999미래를 위해 현재를 희생해라!",
	"06999정말 초등학교때가 좋았는데.\n아~ 그때로 돌아가고 싶어라!",
	"06999선생들은 다 똑같아.",
	"06999뭐 첫사랑때는 진짜인 줄 알았는데, 또 새로운 사랑이 시작되더라구.\n그럭저럭 41이라는 점수를 쌓았지.",
	"06999학교를 만든 녀석.",
	"06999난 배고픈 한 명의 모범생.",
	"06999대머리 아저씨.",
	"16999아유, 글쎄 김씨와 박씨가 그렇다지 뭐유.\n깔깔깔\n아, 그리고 이씨가 그 곳에서 밥을 먹었다네요.\n호호호!",
	"06999아뇨! 내가 안 죽였어!",
	"06999글쎄, 난 아니야.",
	"06999난 아냐! 응?\nM씨? 그게 누구야?",
	"06999음, 좀 했었나?",
	"06999김미노란 탐정이 수상해.\n너무 설치잖아.\n잘난척 하지 말란 말야!",
	"06999아니, 안 할거야.",
	"06999아니, 아무것도 숨기는 것 없어.\n그냥 배가 고파서...\n흑흑... 좀 먹었을 뿐인데...",
	"16999아아... 배고프다.\n그런데 이게 유도심문과 관련있나...",
	"16999빡빡머리다.\n분명 스포츠 머리가 학생머리일텐데...\n이 녀석 사회에 불만있나?",
	"16999눈에 빛이 없다.\n패배자의 눈이다.",
	"16999들창코다.",
	"16999뭔가 묻어있다.\n저건... 빵 조각?",
	"16999크다.\n귀가 크면 부자가 된다던가?",
	"16999완만한 경사를 가지고 있다.",
	"16999목에 촌스러운 빨간 머플러를 두르고 있다.",
	"16999어깨에 먼지가 많이 쌓여있다.",
	"16999단추... 왜 파란색이지?\n교복에 안 맞다.",
	"16999많이 먹는데 살은 안 찌는 타입인가?",
	"16999등에도 먼지가...",
	"16999별특징 없다.",
	"16999뭔가 묻어 있다!\n크림이다!",
	"16999약간 짧다.",
	"16999구두를 신고 있다.\n학생 주제에!",
	"16999우악! 못 볼것을 봤다!",
	"16999크헉! 귀지까지...",
	"16999뭔가 먹고 있는 듯 하다.",
	"16999헉... 왠지 저 바지...\n찢어질 듯 하다.",
	"16999검은때가...\n아아, 보기 괴롭다.",
	"16999발톱에도 때가 끼어 있겠지.",
	"16999W형태이다.",
	"16999교복이다.\n하지만 왠지 이건...\n너무 옛날 것이다.",
	"16999명찰도 뱃지도 달고 있지 않다.",
	"16999안에 뭔가 숨기고 있다.\n빵이나 라면, 그런 것일까?",
	"16999이런 녀석이라면 거기에 돈을 숨기고 있겠지.",
	"16999없다.\n그러고도 인간이군.",
	"16999없다.\n그러고도 인간이군.",
	"16999없다.\n그러고도 인간이군.",
	"16999없다.\n그러고도 인간이군.",
	"16999없다.\n그러고도 인간이군.",
	"16999왜 이 녀석은 학생이면서 나에게 반말이지?\n아니 여기 모두가 나에게 반말을 하고 있다.",
	"16999아무것도 없다.",
	"16999푹신푹신해 보인다.\n고급스럽군.",
	"16999안은 텅텅 비었다.",
	"16999나무로 되어 있다.\n깨끗하게 페인트칠 되어 있다.",
	"169991카오를 얻었다!",
	"16999낮인데도 불이 켜져있다.\n전구가 작긴 하지만.",
	"16999얼핏 잘못보면 눈이 온 것 같이 보이지만 지금은 여름이다.",
	"16999잠겨 있다.\n잠깐! 뭔가가 있다.\n암호를 입력하면 열리게 되있는 것 같다.\n6XX0X7\n무슨 뜻이지?",
	"16999너무 멀어 잘 안 보이지만 나무같은 것이 보인다.",
	"16999검은색 의자다.\n왜 이런 곳에 의자를 두었을까?",
	"16999잠겨있다.\n창고나 그런 것이겠지.\n열면 곰팡이 냄새가 엄청 날테니 억지로 열긴 싫다.",
	"16999나무로 된 계단이다.",
	"16999나무로 된 난간이다.\n약간 약해보이기도 하다.",
	"16999다른 곳과 똑같다.\n별 특징없다.",
	"16999창문이 없어서인지 어둡다.\n그나마 있는 조명도 밝지 않다.",
	"16999각 방들과 연결되어 있다.",
	"16999약한 조명이 빛나고 있다.\n별 이상한 곳은 없어 보인다.",
	"169992층 방의 문들이다.",
	"16999이 계단은 2층과 3층을 연결하고 있다.\n계단이 밑으로 내려가는 것 처럼 보이지만,\n사진 부족이니 신경쓰지 말자.",
	"169993층의 천장이 약간 보인다.\n3층 난간에서 던지면 여기로 떨어지겠군. 크크큭",
	"16999왠지 약해보인다.\n나같은 사람이 사는 집은 아닌가 보군.",
	"16999밝다.\n낮인데 전기 아깝게시리.\n난 어둠이 좋단 말이다.",
	"16999나무들이 많이 보인다.\n여기가 산이라고 착각할지 몰라도 이 저택을 꾸미기 위해 나무를 잔뜩 심은 것이다.\n이 저택 주인은 돈이 많은가 보군.\nM을 잡으면 좀 뜯어내야 겠어.",
	"16999탁자위에 특별한 것은 보이지 않는다.",
	"16999탁자 주위에 의자 4개가 있다.",
	"16999겨울이라면 쓰겠지만 지금은 저걸 보기만 해도 덥다.",
	"16999소년탐정 이동헌이 방영되고 있다.\n마완도 극장에서 봤었지.\n명작이야.",
	"16999물이 조금씩 고여있다.",
	"16999작다.\n저 작은데 어떻게 들어가서 목욕을 한다냐.",
	"16999손이나 씻을까?",
	"16999으아아악!\n악마다!\n아, 나였군.",
	"16999시간이 맞지 않다.\n약이 떨어진 것은 아니다.\n그렇다면 이 시계는 아무도 맞추지 않은 건가?\n그럼 여긴 사람이 살지 않는 곳?",
	"16999여기에 앉아서 밥을 먹을 수 있다.\n하지만 난 밥은 먹고 왔다.\n먹고 싶은 것은 공포의 질린 인간의 비명.",
	"16999잠겨있다.\n아마 밖으로 통하는 문같은데, 왜 밖에서 잠기게 해둔 것일까?",
	"16999열리지 않는다.",
	"16999반창고를 얻었다!",
	"16999가스총을 얻었다!.",
	"16999내가 묻은 시체가 있다.",
	"16999나무는 증인이 되지 못해.",
	"16999하늘이 파랗다.",
	"16999빨리 돌아가자.\n이러다 들키겠다.",
	"16999무기 베개를 얻었다!\n...는 아니겠지.",
	"16999더블이다.\n흐흠.",
	"16999악마의 눈알을 얻었다!",
	"16999낮이니 불을 켤 필요는 없다.",
	"16999나무들이 보이고, 햇빛이 들어오고 있다.\n햇빛이 안 들어오면 침대에 세균이 많이 번식한다고 들은 것도 같고, 내가 알바가 뭐냐..",
	"16999잠겨있다.",
	"01000역시 집은 전망이 좋아야 한다니까.\n높은 곳에서 서민들을 내려다 보는 것만큼 기분 좋은 것은 없지.",
	"16000수색은 안하고 집을 즐기고 있다니.",
	"01000하하, 그 김미노라는 풋내기 탐정, 나에게 명령을 하던데...\n귀찮아서 가만히 있었지.\n주제에 내게 명령을 하다니...",
	"16000오오...\n그 부분은 통하는데.",
	"01000꺼져! 더러운 것!",
	"16999뭐가 어째?",
	"02000아무튼 오랜만이군.\n이동헌...",
	"16000응? 우리가 만났었나?",
	"02000독캔디 사건을 잊었나?\n그 때 만났었지.",
	"16000흐음... 뭐였더라...",
	"02000네가 중요한 증거품인 독캔디를 먹어버린 사건이잖아.",
	"16000아아, 생각났다!\n그래, 그때 맛있어 보이길래 먹었다가 병원에 실려갔지.\n으하하하... 정말 죽는 줄 알았다니까!",
	"02000아무튼 그 사건으로 인해 내 인생에 오점을 남겼어.\n내가 맡은 사건 중에 미해결 사건은 없었거든.\n이번에는 방해하지 않길 바란다.",
	"16000그러는 네 녀석이나 방해하지마라.",
	"02999으하하하... 웃기는군.\n살해나 당하지 마라라.\n살인탐정.\n넌 적이 많으니까.",
	"03999아이구, 누구야?\n잘자고 있었는데...",
	"04000물건 살래?",
	"16999응? 이녀석 상인인가?",
	"04000물건 살래?",
	"16999응? 이녀석 상인인가?",
	"05999뭐, 뭐야?\n이런 곳에",
	"06000헉, 흠흠...",
	"16000뭐야? 방금 뭘 숨긴 것 같은데...",
	"06000아무것도 아냐.",
	"16000이봐, 고문맛을 보고싶나?\n실토 못해?",
	"06000아아... 그냥 배가 고파서...\n사실...",
	"06000이런 음식 맛 보는 것도 얼마만인지 몰라.\n라면만 먹고... 정말 고생하면서 공부를 하는 나의 심정을 알기나 해?",
	"16999그거야 내 알 바 아니지.",
	"16999응? 저 나무에 뭔가 걸려있다.\n저건 열쇠?\n열쇠를 얻었다!",
	"00999허허... 이거 죽여버렸네.\n안 들킬려면 빨리 처리해야 겠어!",
	"00000헉헉. 다 묻었다.",
	"00000여기라면 아무도 모르겠지.\n저택은 밖으로 나가는 문도 잠겨있고.",
	"07000살인이야!\n저기 봐! 누군가 땅에 시체를 묻고 있어!",
	"00999이런! 들켰다!\n하지만 나를 알아보진 못 한것 같군.\n누군가라고 하는 것을 봐서...\n빨리 돌아가서 시치미를 떼야지.\n하지만 만약 들킬 경우를 생각해서 싸울 준비는 해둬야 겠어.",
	"04000당신을 지켜 주려고 했는데...",
	"16000뭐야? 그럼 네가 나의 마니또?\n오오... 내가 무슨 짓을...\n으아아아아아!",
	"16999아아아... 아 좋아 좋아.\n뭐 죽은 사람은 죽었고 산 사람은 살아야지.",
	"02000응? 이동헌, 어디에서 오냐?",
	"16000조사중이었지.\n너처럼 논 줄 알아?",
	"02000그으래? 아무튼...",
	"02000여러 분 유감스럽게 첫번째 희생자가 발생했습니다.\n제 생각엔 M의 소행은 아닌 듯 싶고, 누군가 이 게임을 하기로 한 것 같습니다.\n아무튼 M도 그렇고 살인범도 곧 밝혀 내겠습니다.\n그러니 제 지시를 따라 주십시오.",
	"02000지금부터 여러분은 2층에 각 방에 들어가셔서 문을 잠그고 계십시오.\n전 복도에서 감시하겠습니다.\n여러분을 보호하는 방법이기도 하지만, 제 추리대로라면 이렇게 하면 M녀석이 나타날 겁니다.",
	"02999이동헌 너는 또 맘대로 하겠지?\n아무튼 나는 복도로 간다.\n내 추리는 완벽하니까.\n넌 맘대로 돌아다녀 봐라.",
	"16999뭐야? 아무도 없다.\n분명 김미노는 모두 방에 있어라고 했는데...\n어떻게 된 일이지?",
	"02000이런 젠장!\n네가 M이었나?\n이렇게 당할 순 없지.\n하아아압!\n도망이다!",
	"00000우웃! 빠르다!",
	"00999젠장 놓쳤군",
	"07000죽어라! M!",
	"00999읏, 뭐야?",
	"00999이겼다.\n갑자기 기습을 하다니...\n비겁한 놈들!\n악마. 미워, 미워!",
	"02000어서와라. 이동헌...",
	"16000흠... 아무래도 네가 M인듯 하군.",
	"02000무슨 근거로?",
	"16000감으로!",
	"02000내가 M이 맞다.\n그리고 숨길 필요도 없지.\n왜냐면 넌 죽을 테니까...",
	"16000웃기고 자뿌라졌네.",
	"02000아무튼 쓸모없는 동지들이야.\n하긴 어차피 네 녀석의 숨을 끊는 것은 내가 되어야 했지만...",
	"16000흥, 그런 내가 날 죽이려고 전국구 암살자를 모집했나?",
	"02000암살자... 그런 아마추어들이 암살자로 보이나?\n유수염 빼고는 다 너와 연관이 있는 자들이지.\n다들 너에게 소중한 사람을 잃었지.\n난 그걸 이용해서 이런 기회를 만들어 준 것 뿐이다.\n어차피 기회를 잡지도 못 했지만...",
	"16000아무튼 긴말 필요없군.\n네 녀석을 없애서 이 사건을 끝내야 겠어.",
	"02999나도 마찬가지야.\n이번엔 오점이 없어야지.",
	"16000이것으로 게임 끝이군.\n너의 죽음의 천사가 되어주지.",
	"02000이것으로 끝이라 생각하지 마라.\n너의 원수는 네가 죽인 수 만큼 계속 늘어나고 있다.\n얼마 안 가서 기하급수적으로 늘테지.\n전 세계가 너의 적이 될 것이다.",
	"16000후후후... 지구는 내꺼야.\n그걸 방해하는 자가 있으면 모두 죽인다.",
	"02000그런데 왜 마완도 편에선 고문하다 죽이면 게임오버가 되었지?",
	"16000뭔가 이상한 질문이지만 대답하자면 내 예술적인 고문에 오차가 있었다는게 충격이라서 그랬지.",
	"02000으음, 그랬군.\n해결되지 못 한 마지막 수수께끼가 풀렸구나.\n이젠 그만 가봐야 겠어.",
	"16000잠깐, 나도 묻지?\n므족 소녀는 뭐지?",
	"02000잡상인.",
	"16000아아... 그랬구나.\n그러쿤아.",
	"16999이젠 푹 자라구.",
	"07000살인이야!!!",
	"00999응? 무슨일이지?",
	"16000죽어랏!",
	"01999뭐야? 나의 재산이 탐났던 것인가?\n나도 그냥 당할 순 없지!",
	"16000할머니, 얼마 남지 않은 인생.\n죽어주셔야 겠습니다.",
	"03999무슨 소리여.\n이 늙은이가 약하다고 보는 것 같은데...\n이래뵈도 무림의 고수여.\n나의 독문무공을 보여주지.",
	"16000재수없는 年! 죽어랏!",
	"05000꺄악! 살려줘요!",
	"05999...라고 할 줄 알았어?\n이대로 당할 순 없지!",
	"16000죽어!",
	"06000아니, 내가 뭘 잘못했다고?",
	"16000수염이 맘에 안 들어!",
	"06999뭐가 어째?\n수염을 욕하다니!\n전국의 수염인들을 대표해서 널 심판해주마!\n타올라라! 수염의 불꽃!",
};

#include <stdarg.h>

#define _GetKeyState( vkey ) HIBYTE(GetAsyncKeyState( vkey ))
#define _GetKeyPush( vkey )  LOBYTE(GetAsyncKeyState( vkey ))

FILE* fp;

bool enter=false;
int mode;
char global_buffer[256];
char time_buffer[16];
BOOL m_nosound, m_640;

//효과음 연주
void Play(char* name)
{
	if(!m_nosound)
	{
		jds->SetPosition(name,0.0f);
		if(!m_nosound)jds->Play(name);
	}
}

//문자열 처리 함수
char* StrAdd(char* msg, ...)		//문자+문자
{
	strcpy(global_buffer,"");
	va_list ap;
	va_start(ap,msg);
	int max=strlen(msg);
	for(int i=0; i<max; i++)
	{
		if(msg[i]=='c')
		{
			strcat(global_buffer,va_arg(ap,char*));
		}
		else if(msg[i]=='d')
		{
			char int_buffer[10];
			itoa(va_arg(ap,int),int_buffer,10);
			strcat(global_buffer,int_buffer);
		}
		else puts("Incorrect code!");
	}
	va_end(ap);

	return global_buffer;
}

//최대 최소값
int Max(int x, int y)
{
	if(x>y)return x;
		else return y;
}

int Min(int x, int y)
{
	if(x<y)return x;
		else return y;
}

///////////////////////////////////////////////////////////////////////////////
//스위치와 변수
#define SWITCH_MAX 510
#define VAR_MAX 60

class CSW_VAR
{
public:
	bool sw[SWITCH_MAX];
	int var[VAR_MAX];

	void SetSwitch(int from, int to, bool s);
	void SetVar(int from, int to, int v);
	void InitSwitch(bool s);
	void InitVar(int v);
	void SetVars(int from, int to, ...);
	bool CmpVar(int n, int max, ...);
};

void CSW_VAR::SetSwitch(int from, int to, bool s)
{
	for(int i=from; i<=to; i++)sw[i]=s;
}

void CSW_VAR::SetVar(int from, int to, int v)
{
	for(int i=from; i<=to; i++)var[i]=v;
}

void CSW_VAR::InitSwitch(bool s)
{
	SetSwitch(0,SWITCH_MAX-1,false);
}

void CSW_VAR::InitVar(int v)
{
	SetVar(0,VAR_MAX-1,0);
}

void CSW_VAR::SetVars(int from, int to, ...)
{
	va_list ap;
	va_start(ap,to);
	int max=to-from+1;
	for(int i=0; i<max; i++)
		var[from+i]=va_arg(ap,int);
	va_end(ap);
}

bool CSW_VAR::CmpVar(int n, int max, ...)
{
	bool equal=false;

	va_list ap;
	va_start(ap,max);
	for(int i=0; i<max; i++)
	{
		if(var[n]==va_arg(ap,int))
		{
			equal=true;
			break;
		}
	}
	va_end(ap);

	return equal;
}

CSW_VAR m_sv;

/////////////////////////////////////////////////////
//대화 처리 클래스
class CDlg
{
	int TextPrint(int n_dlg, int y);
	int TextSelect(int y);

public:
	void Background();
	int TextSel(int n_dlg);
	int TextSel(char* input_dlg);
	void TextSnr(int from);
};
CDlg m_dlg;

///////////////////////////////////////////////////////////////////////////////
//게임 진행 클래스
#define EQUIPMAX 6
#define ITEMMAX 23
#define SAVEFILEMAX 10

class CGame
{
	//세이브 관련
	int save_page[SAVEFILEMAX];
	int save_time[SAVEFILEMAX], save_min[SAVEFILEMAX], save_sec[SAVEFILEMAX];
	void ViewFile();

	//시간 관련
	char* GetTime();

	//도구 관련
	void DeleteItem(int n);

public:
	//시간 관련
	int GetTimeN();
	void PlusTime(int s);

	//도구 관련
	int sitem, items;
	void ShowItem(int x, int y, int c);
	void UseItem(int n);

	void Note(bool save_able);
	int MainMenu();

	void Render();
};

char* CGame::GetTime()
{
	char tmp_buffer[9];
	strcpy(time_buffer,"");
	if(m_sv.var[23]<10)strcat(time_buffer,"0");
	strcat(time_buffer,itoa(m_sv.var[23],tmp_buffer,10));
	if((m_sv.var[25]%2)==0)strcat(time_buffer,":");
		else strcat(time_buffer," ");
	if(m_sv.var[24]<10)strcat(time_buffer,"0");
	strcat(time_buffer,itoa(m_sv.var[24],tmp_buffer,10));
	if((m_sv.var[25]%2)==0)strcat(time_buffer,":");
		else strcat(time_buffer," ");
	if(m_sv.var[25]<10)strcat(time_buffer,"0");
	strcat(time_buffer,itoa(m_sv.var[25],tmp_buffer,10));

	return time_buffer;
}

int CGame::GetTimeN()
{
	return m_sv.var[23]*10000+m_sv.var[24]*100+m_sv.var[25];
}

void CGame::PlusTime(int s)
{
	m_sv.var[25]+=s;
	while(m_sv.var[25]>=60)
	{
		m_sv.var[25]-=60;
		m_sv.var[24]++;
	}
	while(m_sv.var[24]>=60)
	{
		m_sv.var[24]-=60;
		m_sv.var[23]++;
	}
}

void CGame::UseItem(int n)
{
	if(m_sv.var[n]<=0)return;

	if(n<EQUIPMAX)m_sv.var[34]=n;	//장비
	else	//사용
	{
		if(m_sv.var[32]<100)
		{
			if(n==EQUIPMAX)
			{
				m_sv.var[32]=Min(100,m_sv.var[32]+10);
				m_sv.var[n]--;
			}
			else if(n==EQUIPMAX+1)
			{
				m_sv.var[32]=Min(100,m_sv.var[32]+25);
				m_sv.var[n]--;
			}
		}
	}
}

void CGame::ShowItem(int x, int y, int c)
{
	char* name[]={"악보","부메랑","화염방사기","악마의 지팡이","가스총","악마의 눈알",
		"반창고","안티프라민","열쇠"};
	items=0;	//아이템 수 세기
		
	for(int i=0; i<ITEMMAX; i++)
	{
		if(m_sv.var[i]<=0)continue;	//없으면 넘어감

		if(i<EQUIPMAX)	//장비 이름
		{
			if(i==m_sv.var[34])jdd->DrawText(backbuffer,name[i],font12,x+15,y,JColor(0,0,255));
				else jdd->DrawText(backbuffer,name[i],font12,x+15,y,JColor(0,0,0));
		}
		else	//아이템 이름
		{
			jdd->DrawText(backbuffer,name[i],font12,x+15,y,JColor(0,0,0));
			jdd->DrawText(backbuffer,StrAdd("dc",m_sv.var[i],"개"),font12,x+125,y,JColor(0,0,0));
		}
		y+=15;
		if(items==c)sitem=i;	//선택한 아이템 번호 돌려 보내기
		items++;
	}
}

void CGame::ViewFile()
{
	for(int i=0; i<SAVEFILEMAX; i++)
	{
		if(fp=fopen(StrAdd("cdc","save\\note",i,".sav"),"rb"))
		{
			//기본적인 페이지, 시간 정보를 가져옴
			fseek(fp,0x2a,SEEK_SET);
			fread(&save_page[i],sizeof(int),1,fp);
			fread(&save_time[i],sizeof(int),1,fp);
			fread(&save_min[i],sizeof(int),1,fp);
			fread(&save_sec[i],sizeof(int),1,fp);
			fclose(fp);
		}
		else save_page[i]=-1;
	}
}

//사건 수첩
void CGame::Note(bool save_able)
{
	char* name[]={"이동헌","일드록","김미노","미라","므족소녀","이소미","유수염"};
	bool inside=false;
	int menu=0, inside_menu;
	RECT noterect;
	SetRect(&noterect,80,20,320,240);
	//사건 개요
	char note_content[512];
	strcpy(note_content,"");
	strcat(note_content,"살인게임 마니또\n자기와 지킬 사람 외\n모두 죽이면 승리\n내가 지킬 사람: ");
	strcat(note_content,name[m_sv.var[29]]);
	strcat(note_content,"\n나의 각오: ");
	if(m_sv.var[30]==0)strcat(note_content,"게임을 즐긴다.");
		else if(m_sv.var[30]==1)strcat(note_content,"M을 찾아낸다.");
		else strcat(note_content,"모두 죽인다.");

	//세이브 파일 정보 얻기
	ViewFile();

	while(1)
	{
		if(PeekMessage(&msg,NULL,0,0,PM_NOREMOVE))
		{
			if(!GetMessage(&msg,NULL,0,0)) break;
			TranslateMessage(&msg);
			DispatchMessage(&msg);
		}

		jdd->DrawPicture(backbuffer,"노트",0,0,NULL);

		//아래로
		if(_GetKeyPush(VK_DOWN))
		{
			if(!inside)
			{
				if(menu<5)menu++;
			}
			else
			{
				if(menu==1 && inside_menu<5 ||	//인물
					menu==2 && inside_menu<items-1 || //도구
					menu==3 && inside_menu<10)	//세이브 파일들
					inside_menu++;
			}
		}
		//위로
		if(_GetKeyPush(VK_UP))
		{
			if(!inside)
			{
				if(menu>0)menu--;
			}
			else
			{
				if(inside_menu>0)inside_menu--;
			}
		}
		//선택
		if(_GetKeyState(VK_RETURN))
		{
			if(!enter)
			{
				enter=true;
				if(menu==1)	//인물
				{
					if(!inside)
					{
						inside=true;
						inside_menu=0;
					}
					else
					{
						if(m_sv.var[36+inside_menu]!=3)
						{
							m_sv.var[36+inside_menu]++;
							if(m_sv.var[36+inside_menu]>=3)m_sv.var[36+inside_menu]=0;
						}
					}
				}
				else if(menu==2)	//도구
				{
					if(!inside)
					{
						inside=true;
						inside_menu=0;
					}
					else
					{
						UseItem(sitem);
					}
				}
				else if(menu==3)	//저장
				{
					if(!inside)
					{
						if(save_able)
						{
							inside=true;
							inside_menu=0;
						}
					}
					else
					{
						if(fp=fopen(StrAdd("cdc","save\\note",inside_menu,".sav"),"wb"))
						{
							fprintf(fp,"사립탐정 이동헌: 나의 수호천사 세이브 파일");
							fwrite(&m_sv.var[35],sizeof(int),1,fp);
							fwrite(&m_sv.var[23],sizeof(int),3,fp);
							fwrite(&m_sv,sizeof(CSW_VAR),1,fp);
							fclose(fp);

							ViewFile();
						}
					}
				}
				else if(menu==4)break;
				else if(menu==5)
				{
					if(save_able)
					{
						if(m_dlg.TextSel("게임을 끝낸다\n농담이란 말이다!")==0)m_sv.sw[8]=true;
						break;
					}
				}
			}
		}
		else enter=false;

		if(inside && _GetKeyState(VK_ESCAPE))inside=false;

		//메뉴
		jdd->DrawPicture(backbuffer,"메뉴얼굴",0,menu*20+20,NULL);
		jdd->DrawText(backbuffer,"사건",font20,21,21,JColor(0,0,0));
		jdd->DrawText(backbuffer,"사건",font20,20,20,JColor(0,0,172));
		jdd->DrawText(backbuffer,"인물",font20,21,41,JColor(0,0,0));
		jdd->DrawText(backbuffer,"인물",font20,20,40,JColor(0,0,172));
		jdd->DrawText(backbuffer,"도구",font20,21,61,JColor(0,0,0));
		jdd->DrawText(backbuffer,"도구",font20,20,60,JColor(0,0,172));
		jdd->DrawText(backbuffer,"기록",font20,21,81,JColor(0,0,0));
		if(save_able)jdd->DrawText(backbuffer,"기록",font20,20,80,JColor(0,0,172));
			else jdd->DrawText(backbuffer,"기록",font20,20,80,JColor(128,128,128));
		jdd->DrawText(backbuffer,"덮기",font20,21,101,JColor(0,0,0));
		jdd->DrawText(backbuffer,"덮기",font20,20,100,JColor(0,0,172));
		jdd->DrawText(backbuffer,"나가기",font20,21,121,JColor(0,0,0));
		if(save_able)jdd->DrawText(backbuffer,"나가기",font20,20,120,JColor(0,0,172));
			else jdd->DrawText(backbuffer,"나가기",font20,20,120,JColor(128,128,128));

		if(menu==0)
		{
			jdd->DrawText(backbuffer,note_content,font12,&noterect,JColor(0,0,0));
		}
		else if(menu==1)
		{
			for(int i=0; i<6; i++)
			{
				if(inside && inside_menu==i)jdd->DrawText(backbuffer,"→",font12,65,i*15+20,JColor(0,0,0));
				jdd->DrawText(backbuffer,name[i+1],font12,80,i*15+20,JColor(0,0,0));

				if(!m_sv.sw[i])jdd->DrawText(backbuffer,"사망",font12,150,i*15+20,JColor(128,128,128));
					else if(m_sv.var[36+i]==0)jdd->DrawText(backbuffer,"무관심",font12,150,i*15+20,JColor(0,172,0));
					else if(m_sv.var[36+i]==1)jdd->DrawText(backbuffer,"요주의",font12,150,i*15+20,JColor(126,128,0));
					else if(m_sv.var[36+i]==2)jdd->DrawText(backbuffer,"제거대상",font12,150,i*15+20,JColor(216,0,0));
					else jdd->DrawText(backbuffer,"보호대상",font12,150,i*15+20,JColor(0,192,192));
			}
		}
		else if(menu==2)
		{
			if(inside)jdd->DrawText(backbuffer,"→",font12,80,inside_menu*15+20,JColor(0,0,0));
			ShowItem(80,20,inside_menu);
		}
		else if(menu==3)
		{
			if(save_able)
			{
				if(inside)jdd->DrawText(backbuffer,"→",font12,80,inside_menu*15+20,JColor(0,0,0));
				for(int i=0; i<SAVEFILEMAX; i++)
				{
					if(save_page[i]==-1)jdd->DrawText(backbuffer,"비어 있음",font12,95,20+i*15,JColor(0,0,0));
						else
						{
							char* background[]={"거실","계단","복도","계단2","3층","욕실","주방","침실","침실","침실","침실","외경"};
							jdd->DrawText(backbuffer,StrAdd("ccdcdcd",background[save_page[i]]," ",save_time[i],":",save_min[i],":",save_sec[i]),font12,95,20+i*15,JColor(0,0,0));
						}
				}
			}
		}

		Render();
	}	
}

//메인 메뉴
int CGame::MainMenu()
{
	bool inside=false;
	int menu=0, inside_menu;

	//세이브 파일 정보 얻기
	ViewFile();

	while(1)
	{
		if(PeekMessage(&msg,NULL,0,0,PM_NOREMOVE))
		{
			if(!GetMessage(&msg,NULL,0,0)) break;
			TranslateMessage(&msg);
			DispatchMessage(&msg);
		}

		jdd->DrawPicture(backbuffer,"타이틀",0,0,NULL);

		//아래로
		if(_GetKeyPush(VK_DOWN))
		{
			if(!inside)
			{
				if(menu<2)menu++;
			}
			else
			{
				if(menu==1 && inside_menu<SAVEFILEMAX-1)	//불러오기
					inside_menu++;
			}
		}
		//위로
		if(_GetKeyPush(VK_UP))
		{
			if(!inside)
			{
				if(menu>0)menu--;
			}
			else
			{
				if(inside_menu>0)inside_menu--;
			}
		}
		//선택
		if(_GetKeyState(VK_RETURN))
		{
			if(!enter)
			{
				enter=true;
				if(menu==1)	//불러오기
				{
					if(!inside)
					{
						inside=true;
						inside_menu=0;
					}
					else
					{
						if(fp=fopen(StrAdd("cdc","save\\note",inside_menu,".sav"),"rb"))
						{
							fseek(fp,0x3a,SEEK_SET);
							fread(&m_sv,sizeof(CSW_VAR),1,fp);
							fclose(fp);
							break;
						}
					}
				}
				else break;
			}
		}
		else enter=false;

		if(inside && _GetKeyState(VK_ESCAPE))inside=false;

		//메뉴
		jdd->DrawPicture(backbuffer,"메뉴얼굴",0,menu*20+80,NULL);
		jdd->DrawText(backbuffer,"새 게임",font20,21,81,JColor(0,0,0));
		jdd->DrawText(backbuffer,"새 게임",font20,20,80,JColor(0,0,172));
		jdd->DrawText(backbuffer,"사건수첩",font20,21,101,JColor(0,0,0));
		jdd->DrawText(backbuffer,"사건수첩",font20,20,100,JColor(0,0,172));
		jdd->DrawText(backbuffer,"끝내기",font20,21,121,JColor(0,0,0));
		jdd->DrawText(backbuffer,"끝내기",font20,20,120,JColor(0,0,172));

		if(menu==1)
		{
			if(inside)jdd->DrawText(backbuffer,"→",font12,105,inside_menu*15+80,JColor(0,0,0));
			for(int i=0; i<SAVEFILEMAX; i++)
			{
				if(save_page[i]==-1)jdd->DrawText(backbuffer,"비어 있음",font12,120,80+i*15,JColor(0,0,0));
				else
				{
					char* background[]={"거실","계단","복도","계단2","3층","욕실","주방","침실","침실","침실","침실","외경"};
					jdd->DrawText(backbuffer,StrAdd("ccdcdcd",background[save_page[i]]," ",save_time[i],":",save_min[i],":",save_sec[i]),font12,120,80+i*15,JColor(0,0,0));
				}
			}
		}

		jdd->Render();
	}	

	return menu;
}

void CGame::Render()	//공통 사항
{
	for(int i=0; i<m_sv.var[32]; i++)jdd->DrawPicture(backbuffer,"HP",i+2,2,NULL);
	jdd->DrawPicture(backbuffer,"HPMAX",0,0,NULL);
	jdd->DrawText(backbuffer,StrAdd("dc",m_sv.var[33],"카오"),font20,111,1,JColor(0,0,0));
	jdd->DrawText(backbuffer,global_buffer,font20,110,0,JColor(255,255,0));
	jdd->DrawText(backbuffer,GetTime(),font20,231,1,JColor(0,0,0));
	jdd->DrawText(backbuffer,GetTime(),font20,230,0,JColor(0,255,255));
	jdd->Render();
}

CGame m_game;

/////////////////////////////////////////////////////
//대화 처리 메소드

void CDlg::Background()
{
	//얼굴,배경 출력
	char* background[]={"거실","계단","복도","계단2","3층","욕실","주방","침실","침실","침실","침실","외경"};
	jdd->DrawPicture(backbuffer,background[m_sv.var[35]],0,0,NULL);
	if(m_sv.var[26]>0 && m_sv.var[26]<7)
	{
		int facex[]={30,60,60,40,60,70};
		int facey=0;
		if(m_sv.var[26]==4)facey=40;
		jdd->DrawPicture(backbuffer,StrAdd("cd","Face",m_sv.var[26]),facex[m_sv.var[26]-1],facey,NULL);
	}
}

#define SNR_START 5
//대화 출력
int CDlg::TextPrint(int n_dlg, int y)
{
	int length=strlen(snr[n_dlg]);
	char dlg_buffer[1024];
	strcpy(dlg_buffer,snr[n_dlg]);
	bool ani_end=false;

	//얼굴 알아내기
	char* name[]={"이동헌","일드록","김미노","미라","므족소녀","이소미","유수염","???"};
	char tmp[4];
	for(int i=0; i<2; i++)
		tmp[i]=dlg_buffer[i];
	tmp[2]=NULL;
	int name_no=atoi(tmp);
	if(name_no<16)m_sv.var[26]=name_no;

	//대화를 출력하기 알맞게 처리
	int sp=SNR_START, msp=SNR_START, space;	//처리되고 있는 포인트, 이전까지 처리한 포인트, space가 있던 곳
	while(sp<length)
	{
		if(dlg_buffer[sp]==' ')space=sp;
		if(dlg_buffer[sp]=='\n')msp=sp;
		if(sp-msp>=30)
		{
			dlg_buffer[space]='\n';
			msp=space;
		}
		sp++;
	}

	RECT text, shadow;
	SetRect(&text,0,y,320,240);
	SetRect(&shadow,1,y+1,320,240);

	sp=SNR_START;
	int n_of_e=0, tp=0;	//줄바꿈 횟수, 출력하는 단어
	while(1)
	{
		if(PeekMessage(&msg,NULL,0,0,PM_NOREMOVE))
		{
			if(!GetMessage(&msg,NULL,0,0)) break;
			TranslateMessage(&msg);
			DispatchMessage(&msg);
		}

		//대화출력
		char text_buffer[256];
		if(!ani_end)
		{
			if(sp<length && n_of_e<4)
			{
				if(dlg_buffer[sp]=='\n')n_of_e++;
				text_buffer[tp]=dlg_buffer[sp];
				if(dlg_buffer[sp]&0x80)	//한글일 경우 2칸 전진
				{
					sp++; tp++;
					text_buffer[tp]=dlg_buffer[sp];
				}
				text_buffer[tp+1]=NULL;
				//포인터 증가
				sp++; tp++;
			}
			else ani_end=true;
		}
		else
		{
			//다음으로
			if(_GetKeyState(VK_RETURN))
			{
				if(!enter)
				{
					enter=true;
					m_game.PlusTime(5);
					if(sp<length)
					{
						ani_end=false;
						n_of_e=0;
						tp=0;
					}
					else break;
				}
			}
			else enter=false;
		}
		//출력
		Background();
		jdd->DrawText(backbuffer,name[name_no%8],font20,1,141,JColor(0,0,0));
		jdd->DrawText(backbuffer,name[name_no%8],font20,0,140,JColor(0,216,0));
		jdd->DrawPicture(backbuffer,"대화창",0,160,NULL);
		jdd->DrawText(backbuffer,text_buffer,font20,&shadow,JColor(0,0,0));
		jdd->DrawText(backbuffer,text_buffer,font20,&text,JColor(255,255,255));
		m_game.Render();
		if(!ani_end && !_GetKeyState(VK_RETURN))Sleep(20);
	}

	//명령문 읽기
	for(i=0; i<3; i++)
		tmp[i]=dlg_buffer[i+2];
	tmp[3]=NULL;
	return atoi(tmp);
}

//선택지
int CDlg::TextSel(int n_dlg)
{
	strcpy(global_buffer,snr[n_dlg]);
	return TextSelect(160);
}

int CDlg::TextSel(char* input_dlg)
{
	strcpy(global_buffer,input_dlg);
	return TextSelect(160);
}

int CDlg::TextSelect(int y)
{
	char dlg_buffer[4][256];
	int length=strlen(global_buffer);

	//대화를 출력하기 알맞게 처리
	int n_of_e=0, select=0, buffer_no=0, bp=0;
	for(int i=0; i<length; i++)
	{
		if(global_buffer[i]=='\n')
		{
			n_of_e++;
			if((n_of_e%4)==0)
			{
				dlg_buffer[buffer_no][bp]=NULL;
				buffer_no++;
				bp=0;
				continue;
			}
		}
		dlg_buffer[buffer_no][bp]=global_buffer[i];
		bp++;
	}
	dlg_buffer[buffer_no][bp]=NULL;

	RECT text, shadow, text2, shadow2, text3, shadow3, text4, shadow4;
	if(n_of_e<4)	//4개 이하의 선택
	{
		SetRect(&text,0,y,320,240);
		SetRect(&shadow,1,y+1,320,240);
	}
	else if(n_of_e<8)	//8개 이하의 선택
	{
		SetRect(&text,0,y,160,240);
		SetRect(&shadow,1,y+1,160,240);
		SetRect(&text2,160,y,320,240);
		SetRect(&shadow2,161,y+1,320,240);
	}
	else	//16개 이하의 선택
	{
		SetRect(&text,0,y,80,240);
		SetRect(&shadow,1,y+1,80,240);
		SetRect(&text2,80,y,160,240);
		SetRect(&shadow2,81,y+1,160,240);
		SetRect(&text3,160,y,240,240);
		SetRect(&shadow3,161,y+1,240,240);
		SetRect(&text4,240,y,320,240);
		SetRect(&shadow4,241,y+1,320,240);
	}

	while(1)
	{
		if(PeekMessage(&msg,NULL,0,0,PM_NOREMOVE))
		{
			if(!GetMessage(&msg,NULL,0,0)) break;
			TranslateMessage(&msg);
			DispatchMessage(&msg);
		}

		//선택지
		if(_GetKeyPush(VK_DOWN))
		{
			select=Min(n_of_e,select+1);
		}
		else if(_GetKeyPush(VK_UP))
		{
			select=Max(0,select-1);
		}
		if(_GetKeyPush(VK_RIGHT))
		{
			if(select+4<=n_of_e)select+=4;
		}
		else if(_GetKeyPush(VK_LEFT))
		{
			if(select-4>=0)select-=4;
		}

		if(_GetKeyState(VK_RETURN))
		{
			if(!enter)
			{
				enter=true;
				break;
			}
		}
		else enter=false;
		
		Background();
		jdd->DrawPicture(backbuffer,"대화창",0,160,NULL);
		if(n_of_e<4)	//4개 이하의 선택
		{
			jdd->DrawPicture(backbuffer,"선택",0,y+select*20,NULL);
			jdd->DrawText(backbuffer,dlg_buffer[0],font20,&shadow,JColor(0,0,0));
			jdd->DrawText(backbuffer,dlg_buffer[0],font20,&text,JColor(255,255,255));
		}
		else if(n_of_e<8)	//8개 이하의 선택
		{
			int sx, sy;
			sx=select/4*160;
			sy=y+(select%4)*20;
			RECT src_rect;
			SetRect(&src_rect,0,0,80,20);
			jdd->DrawPicture(backbuffer,"선택",sx,sy,&src_rect);
			SetRect(&src_rect,240,0,320,20);
			jdd->DrawPicture(backbuffer,"선택",sx+80,sy,&src_rect);

			jdd->DrawText(backbuffer,dlg_buffer[0],font20,&shadow,JColor(0,0,0));
			jdd->DrawText(backbuffer,dlg_buffer[0],font20,&text,JColor(255,255,255));
			jdd->DrawText(backbuffer,dlg_buffer[1],font20,&shadow2,JColor(0,0,0));
			jdd->DrawText(backbuffer,dlg_buffer[1],font20,&text2,JColor(255,255,255));
		}
		else	//그 이상(최대 16개)
		{
			int sx, sy;
			sx=select/4*80;
			sy=y+(select%4)*20;
			RECT src_rect;
			SetRect(&src_rect,0,0,40,20);
			jdd->DrawPicture(backbuffer,"선택",sx,sy,&src_rect);
			SetRect(&src_rect,280,0,320,20);
			jdd->DrawPicture(backbuffer,"선택",sx+40,sy,&src_rect);

			jdd->DrawText(backbuffer,dlg_buffer[0],font20,&shadow,JColor(0,0,0));
			jdd->DrawText(backbuffer,dlg_buffer[0],font20,&text,JColor(255,255,255));
			jdd->DrawText(backbuffer,dlg_buffer[1],font20,&shadow2,JColor(0,0,0));
			jdd->DrawText(backbuffer,dlg_buffer[1],font20,&text2,JColor(255,255,255));
			jdd->DrawText(backbuffer,dlg_buffer[2],font20,&shadow3,JColor(0,0,0));
			jdd->DrawText(backbuffer,dlg_buffer[2],font20,&text3,JColor(255,255,255));
			if(n_of_e>=12)
			{
				jdd->DrawText(backbuffer,dlg_buffer[3],font20,&shadow4,JColor(0,0,0));
				jdd->DrawText(backbuffer,dlg_buffer[3],font20,&text4,JColor(255,255,255));
			}
		}
		m_game.Render();
	}

	jdd->DrawPicture(backbuffer,"Dlg",0,160,NULL);
	return select;
}

//대화처리의 메인
void CDlg::TextSnr(int from)
{
	int command=0;
	while(command!=999)
	{
		m_sv.var[31]=from;	//페이지 수 기억
		command=TextPrint(from,160);
		if(command==0)from++;			
	}
	jdd->DrawPicture(backbuffer,"Dlg",0,160,NULL);
}

//////////////////////////////////////////////////////////////////////////////
//전투 클래스
#define XSIZE 30
#define YSIZE 38
#define Y_MAX 240

int GetGradient(int x1, int y1, int x2, int y2)
{
	int dx=x2-x1;
	int dy=y2-y1;
	//4방향
	if(dx==0)
	{
		if(dy<=0)return 0;
			else return 8;
	}
	else if(dy==0)
	{
		if(dx>=0)return 4;
			else return 12;
	}
	//기타 방향
	int dg=(abs(dx)*10)/abs(dy);

	if(dx>=0 && dy<0)
	{
		if(dg<5)return 1;
			else if(dg<20)return 2;
			else if(dg<50)return 3;
			else return 4;
	}
	else if(dx>=0 && dy>=0)
	{
		if(dg<5)return 7;
			else if(dg<20)return 6;
			else if(dg<50)return 5;
			else return 4;
	}
	else if(dx<0 && dy>=0)
	{
		if(dg<5)return 9;
			else if(dg<20)return 10;
			else if(dg<50)return 11;
			else return 12;
	}
	else
	{
		if(dg<5)return 15;
			else if(dg<20)return 14;
			else if(dg<50)return 13;
			else return 12;
	}
}

//스프라이트 클래스
class CSpr
{
	int speed;
	int ani_tempo;
	int dir_type;

public:
	int type;
	bool life;
	int tempo;
	int x, y;
	int x_size, y_size;
	int power;
	int hp;
	char dir;
	int invincible;

	void SetSpr(int vx, int vy, int vtype, int h);
	void Move();
	void Control();
	void Show();
	void Hurt(int damage);
};

void CSpr::SetSpr(int vx, int vy, int vtype, int h)
{
	//초기화
	life=true;
	ani_tempo=tempo=0;
	invincible=0;
	dir=0;

	x=vx;
	y=vy;
	hp=h;
	type=vtype;

	//종류에 맞는 파워와 스피드등을 부여
	int spd[]={1,1,0,1,0,1,4};
	int xs[]={24,24,24,24,24,24,24};
	int ys[]={32,32,32,32,32,32,32};
	int dirt[]={0,1,1,1,1,1,1};

	power=0;
	speed=spd[type];
	x_size=xs[type];
	y_size=ys[type];
	dir_type=dirt[type];
}

void CSpr::Move()
{
	if(type==1)	//일드록
	{
		if(dir==0)y-=speed;
			else y+=speed;
		if(y>200)dir=0;
			else if(y<10)dir=1;
	}
	else if(type==3)	//미라
	{
		if(tempo<300){ x+=rand()%5-3; y+=rand()%5-2; }
			else if(tempo<600){ x+=rand()%5+1; y+=rand()%5-2; }
			else tempo=0;
	}
	else if(type==5)	//이소미
	{
		if(tempo==300)
		{
			x=rand()%(320-XSIZE);
			y=rand()%(Y_MAX-YSIZE);
			tempo=0;
		}
	}
	else if(type==6)	//유수염
	{
		if(dir==0){x=Min(320-x_size,x+speed);y=Max(0,y-speed);}
			else if(dir==1){x=Min(320-x_size,x+speed);y=Min(Y_MAX-y_size,y+speed);}
			else if(dir==2){x=Max(0,x-speed);y=Min(Y_MAX-y_size,y+speed);}
			else if(dir==3){x=Max(0,x-speed);y=Max(0,y-speed);}
		if(tempo==50)
		{
			dir=rand()%4;
			tempo=0;
		}
	}

	if((++tempo%10)==0)
	{
		if(++ani_tempo >= 4)ani_tempo=0;
	}

	x=Max(0,Min(320-x_size,x));
	y=Max(0,Min(Y_MAX-y_size,y));
}

void CSpr::Control()
{
	if(_GetKeyState(VK_UP)){ y=Max(0,y-speed); dir=0; }
		else if(_GetKeyState(VK_DOWN)){ y=Min(Y_MAX-y_size,y+speed); dir=2; }
	if(_GetKeyState(VK_LEFT)){ x=Max(0,x-speed); dir=3; }
		else if(_GetKeyState(VK_RIGHT)){ x=Min(320-x_size,x+speed); dir=1; }

	Move();
}

void CSpr::Show()
{
	char* surfname[]={"LDH","IDR","MINO","MIRA","","SOMI","YUSU"};
	int frame=ani_tempo;
	if(frame==3)frame=1;

	if((invincible%2)==0)
	{
		RECT src_rect;
		//4방향 캐릭터
		if(dir_type==0)SetRect(&src_rect,frame*XSIZE,dir*YSIZE,frame*XSIZE+XSIZE,dir*YSIZE+YSIZE);
		//한방향 캐릭터
			else
			{
				SetRect(&src_rect,frame*XSIZE,0,frame*XSIZE+XSIZE,YSIZE);
			}
		jdd->DrawPicture(backbuffer,surfname[type],x,y,&src_rect);
	}
	if(invincible>0)invincible--;
}

void CSpr::Hurt(int damage)
{
	if(damage==0)m_sv.var[33]++;
	else
	{
		if(invincible<=0)
		{
				hp=Max(0,hp-damage);
				invincible=30;
				if(hp==0)life=false;
		}
	}
}

//탄환 클래스
class CMissile
{
	int type, angle;
	int speed;
	int ani_tempo;
	int delaytime, mirror;

public:
	bool life;
	int x, y;
	int x_size, y_size;
	int power;
	int delay;
	int mirror_count;

	void SetMissile(int vx, int vy, int vangle, int vtype);
	void SetGradient(int x2, int y2);
	void Move(int t1, int t2);
	void Show();
};

void CMissile::SetMissile(int vx, int vy, int vangle, int vtype)
{
	//초기화
	life=true;
	ani_tempo=delay=0;
	mirror_count=0;

	//좌표 각도 종류
	x=vx;
	y=vy;
	angle=vangle;
	type=vtype;

	//종류에 맞는 파워와 스피드등을 부여
	int pow[]={1,1,2,1,2,1,5,0,1};
	int spd[]={4,2,0,5,1,4,1,3,3};
	int dly[]={100,-1,200,50,200,-1,300,100,100};
	bool mir[]={true,false,false,false,false,true,false,false,false};
	int xs[]={14,20,17,22,40,20,40,15,5};
	int ys[]={21,19,27,30,40,20,40,15,5};

	power=pow[type];
	speed=spd[type];
	delaytime=dly[type];
	mirror=mir[type];
	x_size=xs[type];
	y_size=ys[type];
}

void CMissile::Move(int t1, int t2)
{
	//0~4까지의 퍼센트값을 받아서 스피드에 곱함
	//0을 0도로 해서 16방향
	if(angle<0)angle+=16;
		else if(angle>=16)angle-=16;

	int x_percent, y_percent;
	if(angle==0){ x_percent=0; y_percent=-4; }
		else if(angle==1){ x_percent=1; y_percent=-3; }
		else if(angle==2){ x_percent=2; y_percent=-2; }
		else if(angle==3){ x_percent=3; y_percent=-1; }
		else if(angle==4){ x_percent=4; y_percent=0; }
		else if(angle==5){ x_percent=3; y_percent=1; }
		else if(angle==6){ x_percent=2; y_percent=2; }
		else if(angle==7){ x_percent=1; y_percent=3; }
		else if(angle==8){ x_percent=0; y_percent=4; }
		else if(angle==9){ x_percent=-1; y_percent=3; }
		else if(angle==10){ x_percent=-2; y_percent=2; }
		else if(angle==11){ x_percent=-3; y_percent=1; }
		else if(angle==12){ x_percent=-4; y_percent=0; }
		else if(angle==13){ x_percent=-3; y_percent=-1; }
		else if(angle==14){ x_percent=-2; y_percent=-2; }
		else if(angle==15){ x_percent=-1; y_percent=-3; }

	if((x_percent%4)==0)x+=speed*x_percent/4;
		else if(angle<8)x+=speed*x_percent/4+1;
		else x+=speed*x_percent/4-1;
	if((y_percent%4)==0)y+=speed*y_percent/4;
		else if(angle<4 || angle>=12)y+=speed*y_percent/4-1;
		else y+=speed*y_percent/4+1;
	delay++;
	if(delaytime>=0 && delay>=delaytime)life=false;

	//반사
	if(mirror)
	{
		if(y<0 || y+y_size>Y_MAX)
		{
			angle=8-angle;
			mirror_count++;
			power++;
		}
		if(x<0 || x+x_size>320)
		{
			angle=-angle;
			mirror_count++;
			power++;
		}
	}

	//부메랑
	if(type==1)
	{
		if(y+y_size<0 || y>Y_MAX || x+x_size<0 || x>320)life=false;
		if(delay==50)
		{
			mirror_count++;
			angle+=8;
		}
	}
	//가스총
	else if(type==4)
	{
		if(y+y_size<0 || y>Y_MAX || x+x_size<0 || x>320)life=false;
	}
	//악마의 눈알
	else if(type==5)
	{
		if(((delay+50)%100)==0)	//악마의 눈알의 이동
		{
			SetGradient(t1,t2);
			mirror_count++;
			power++;
		}
	}

	//회수
	if(type==1 || type==5)
	{
		if(t1+XSIZE > x && t1 <=x+x_size && t2+YSIZE > y && t2 <=y+x_size && delay>=50)life=false;
	}


	//애니메이션
	if((delay%10)==0)
	{
		if(++ani_tempo >= 4)ani_tempo=0;
	}
}

void CMissile::Show()
{
	char* surfname[]={"Ah","Boomerang","Fire","Evil","Gas","Eye","Poison","Coin","Dot"};
	int frame=ani_tempo;
	if(frame==3)frame=1;
	jdd->DrawPicture(backbuffer,StrAdd("cd",surfname[type],frame),x,y,NULL);
}

void CMissile::SetGradient(int x2, int y2)
{
	angle=GetGradient(x,y,x2,y2);
}

//전투 처리
#define SPRMAX 6
#define MISSILE_MAX 100
#define ENEMY_MISSILE 3

class CBattle
{
	CSpr spr[SPRMAX];
	CMissile msl[MISSILE_MAX];

	int MslNo(bool enemy);
	int SprNo();

public:
	CBattle(int enemy);
	bool Crush(int spr_no, int msl_no);
	bool Battle();
};

CBattle::CBattle(int enemy)
{
	for(int i=0; i<SPRMAX; i++)spr[i].life=false;
	for(i=0; i<MISSILE_MAX; i++)msl[i].life=false;

	spr[SPRMAX-1].SetSpr(0,80,0,m_sv.var[32]);

	spr[0].SetSpr(290,80,enemy,Max(50,Min(320,100-m_sv.var[47+enemy]+(m_sv.var[27]*50))));
}

int CBattle::MslNo(bool enemy)
{
	int start, id_max;
	if(enemy){ start=ENEMY_MISSILE; id_max=MISSILE_MAX; }
		else{ start=0; id_max=ENEMY_MISSILE; }
	for(int i=start; i<id_max; i++)
		if(!msl[i].life)return i;
	
	return -1;
}

int CBattle::SprNo()
{
	for(int i=0; i<SPRMAX; i++)
		if(spr[i].life)return i;
	
	return -1;
}

bool CBattle::Crush(int spr_no, int msl_no)
{
	int left1=spr[spr_no].x, left2=msl[msl_no].x;
	int top1=spr[spr_no].y, top2=msl[msl_no].y;
	int right1=spr[spr_no].x+spr[spr_no].x_size, right2=msl[msl_no].x+msl[msl_no].x_size;
	int bottom1=spr[spr_no].y+spr[spr_no].y_size, bottom2=msl[msl_no].y+msl[msl_no].y_size;
	
	if(left1<right2 && right1>left2 && top1<bottom2 && bottom1>top2)
		return true;
	else
		return false;
}

bool CBattle::Battle()
{
	if(!m_nosound)jds->Stop("BGM");
	if(!m_nosound)jds->Play("Battle");

	int back_start=0;
	int sec=0;
	RECT src_rect;
	while(!m_sv.sw[8] && spr[0].life && spr[SPRMAX-1].life)
	{
		if(PeekMessage(&msg,NULL,0,0,PM_NOREMOVE))
		{
			if(!GetMessage(&msg,NULL,0,0)) break;
			TranslateMessage(&msg);
			DispatchMessage(&msg);
		}

		if(_GetKeyState(VK_SPACE))
		{
			m_game.Note(false);
			spr[SPRMAX-1].hp=m_sv.var[32];
		}
		if(_GetKeyState(VK_RETURN))
		{
			if(!enter)
			{
				enter=true;
				int shoot_angle=spr[SPRMAX-1].dir*4;
				
				if(m_sv.var[34]==0)	//음파
				{
					if(!msl[0].life && !msl[1].life && !msl[2].life)
					{
						msl[0].SetMissile(spr[SPRMAX-1].x,spr[SPRMAX-1].y,shoot_angle,m_sv.var[34]);
						msl[1].SetMissile(spr[SPRMAX-1].x,spr[SPRMAX-1].y,shoot_angle-2,m_sv.var[34]);
						msl[2].SetMissile(spr[SPRMAX-1].x,spr[SPRMAX-1].y,shoot_angle+2,m_sv.var[34]);
						Play("Ral");
					}
				}
				else if(m_sv.var[34]==3)	//악마의 지팡이
				{
					int id_no=MslNo(false);
					if(id_no>=0)
					{
						int target=SprNo();
						if(target>=0)msl[id_no].SetMissile(spr[SPRMAX-1].x,spr[SPRMAX-1].y,
							GetGradient(spr[SPRMAX-1].x,spr[SPRMAX-1].y,spr[target].x,spr[target].y),m_sv.var[34]);
					}
				}
				else
				{
					int id_no=MslNo(false);
					if(id_no>=0)
					{
						msl[id_no].SetMissile(spr[SPRMAX-1].x,spr[SPRMAX-1].y,shoot_angle,m_sv.var[34]);
						if(m_sv.var[34]==1)Play("Boomerang");
							else if(m_sv.var[34]==2)Play("Fire");
					}
				}
			}
		}
		else enter=false;

		if(--back_start <0)back_start=320;
		if(back_start==0)
			jdd->DrawPicture(backbuffer,"BattleBack",0,0,NULL);
		else
		{
			SetRect(&src_rect,0,0,320-back_start,240);
			jdd->DrawPicture(backbuffer,"BattleBack",back_start,0,&src_rect);
			SetRect(&src_rect,320-back_start,0,320,240);
			jdd->DrawPicture(backbuffer,"BattleBack",0,0,&src_rect);
		}

		//이동헌
		if(spr[SPRMAX-1].life)
		{
			spr[SPRMAX-1].Control();
			spr[SPRMAX-1].Show();
		}
		//적
		for(int i=0; i<SPRMAX-1; i++)
			if(spr[i].life)
			{
				spr[i].Move();
				spr[i].Show();
				//일드록
				if(spr[i].type==1)
				{
					if((spr[i].tempo%50)==0)
					{
						int type_no;
						int id_no=MslNo(true);
						if((rand()%10)==0)type_no=7;
							else type_no=8;
						if(id_no>=0)msl[id_no].SetMissile(spr[i].x+XSIZE/2,spr[i].y+YSIZE/2,13,type_no);
						id_no=MslNo(true);
						if((rand()%10)==0)type_no=7;
							else type_no=8;
						if(id_no>=0)msl[id_no].SetMissile(spr[i].x+XSIZE/2,spr[i].y+YSIZE/2,12,type_no);
						id_no=MslNo(true);
						if((rand()%10)==0)type_no=7;
							else type_no=8;
						if(id_no>=0)msl[id_no].SetMissile(spr[i].x+XSIZE/2,spr[i].y+YSIZE/2,11,type_no);
					}
				}
				//김미노
				else if(spr[i].type==2)
				{
					if((spr[i].tempo%10)==0)
					{
						int id_no=MslNo(true);
						if(id_no>=0)msl[id_no].SetMissile(spr[i].x+XSIZE/2,spr[i].y+YSIZE/2,(spr[i].tempo/10)%16,8);
					}
				}
				//미라
				else if(spr[i].type==3)
				{
					if((spr[i].tempo%100)==0)
					{
						int id_no=MslNo(true);
						if(id_no>=0)msl[id_no].SetMissile(spr[i].x,spr[i].y,(rand()%7)+9,6);
					}
				}
				//이소미
				else if(spr[i].type==5)
				{
					if((spr[i].tempo%30)==0)
					{
						int id_no=MslNo(true);
						if(id_no>=0)msl[id_no].SetMissile(320-spr[i].x,Y_MAX-spr[i].y,GetGradient(320-spr[i].x,Y_MAX-spr[i].y,spr[SPRMAX-1].x,spr[SPRMAX-1].y),8);
					}
				}
				//유수염
				else if(spr[i].type==6)
				{
					if((spr[i].tempo%5)==0)
					{
						int id_no=MslNo(true);
						if(id_no>=0)msl[id_no].SetMissile(spr[i].x,spr[i].y,0,2);
					}
				}
			}
		//아군 미사일
		for(i=0; i<ENEMY_MISSILE; i++)
			if(msl[i].life)
			{
				msl[i].Move(spr[SPRMAX-1].x,spr[SPRMAX-1].y);
				msl[i].Show();

				//충돌검사
				for(int j=0; j<SPRMAX-1; j++)
					if(spr[j].life && Crush(j,i))
					{						
						if(spr[j].type==2)
						{
							if(msl[i].mirror_count>=2)
							{
								spr[j].Hurt(msl[i].power);
								Play("Puck");
							}
							spr[j].x=rand()%(320-XSIZE);
							spr[j].y=rand()%(Y_MAX-YSIZE);
						}
						else
						{
							spr[j].Hurt(msl[i].power);
							Play("Puck");
						}
					}
			}
		//적군 미사일
		for(i=ENEMY_MISSILE; i<MISSILE_MAX; i++)
			if(msl[i].life)
			{
				msl[i].Move(spr[SPRMAX-1].x,spr[SPRMAX-1].y);
				msl[i].Show();

				if(spr[SPRMAX-1].life && Crush(SPRMAX-1,i))
				{
					spr[SPRMAX-1].Hurt(msl[i].power);
					m_sv.var[32]=spr[SPRMAX-1].hp;
					msl[i].life=false;
				}
			}

		//적의 에너지
		for(i=0; i<spr[0].hp; i++)jdd->DrawPicture(backbuffer,"HP",i,230,NULL);
		//시간
		if(++sec >= 100)
		{
			m_game.PlusTime(1);
			sec=0;
		}
		m_game.Render();
	}

	if(!m_nosound)jds->Stop("Battle");
	if(spr[SPRMAX-1].life && !m_nosound)jds->Play("BGM");
	return spr[SPRMAX-1].life;
}